Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x192e (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x4a406): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m0plus -mfloat-abi=soft -mthumb -march=armv6s-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x782bf): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x4c119): C:/Users/user/STM32CubeIDE/workspace_1.9.0/motor/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x43591): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x27608): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x61a57): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x644fa): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x6df99): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x80dad): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x52cf8): __int32_t
    <62>   DW_AT_decl_file   : 3
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xbd69): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x5608c): __uint32_t
    <75>   DW_AT_decl_file   : 3
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x29caa): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x3d6e0): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1c7d2): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x31022): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x2760a): uint8_t
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x6256f): uint16_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x52cfa): int32_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 44
    <c8>   DW_AT_decl_column : 19
    <c9>   DW_AT_type        : <0x5d>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x61e02): uint32_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x70>
 <1><d9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 7 (DW_TAG_array_type)
    <df>   DW_AT_type        : <0xd9>
    <e3>   DW_AT_sibling     : <0xee>
 <2><e7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <e8>   DW_AT_type        : <0x98>
    <ec>   DW_AT_upper_bound : 1
 <2><ed>: Abbrev Number: 0
 <1><ee>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <ef>   DW_AT_type        : <0xde>
 <1><f3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4>   DW_AT_byte_size   : 16
    <f5>   DW_AT_decl_file   : 5
    <f6>   DW_AT_decl_line   : 234
    <f7>   DW_AT_decl_column : 9
    <f8>   DW_AT_sibling     : <0x131>
 <2><fc>: Abbrev Number: 10 (DW_TAG_member)
    <fd>   DW_AT_name        : CCR
    <101>   DW_AT_decl_file   : 5
    <102>   DW_AT_decl_line   : 236
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xd9>
    <108>   DW_AT_data_member_location: 0
 <2><109>: Abbrev Number: 11 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x57e6e): CNDTR
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 237
    <110>   DW_AT_decl_column : 17
    <111>   DW_AT_type        : <0xd9>
    <115>   DW_AT_data_member_location: 4
 <2><116>: Abbrev Number: 11 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0x81cf1): CPAR
    <11b>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 238
    <11d>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xd9>
    <122>   DW_AT_data_member_location: 8
 <2><123>: Abbrev Number: 11 (DW_TAG_member)
    <124>   DW_AT_name        : (indirect string, offset: 0x4a61d): CMAR
    <128>   DW_AT_decl_file   : 5
    <129>   DW_AT_decl_line   : 239
    <12a>   DW_AT_decl_column : 17
    <12b>   DW_AT_type        : <0xd9>
    <12f>   DW_AT_data_member_location: 12
 <2><130>: Abbrev Number: 0
 <1><131>: Abbrev Number: 3 (DW_TAG_typedef)
    <132>   DW_AT_name        : (indirect string, offset: 0x6d77b): DMA_Channel_TypeDef
    <136>   DW_AT_decl_file   : 5
    <137>   DW_AT_decl_line   : 240
    <138>   DW_AT_decl_column : 3
    <139>   DW_AT_type        : <0xf3>
 <1><13d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <13e>   DW_AT_byte_size   : 8
    <13f>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 242
    <141>   DW_AT_decl_column : 9
    <142>   DW_AT_sibling     : <0x161>
 <2><146>: Abbrev Number: 10 (DW_TAG_member)
    <147>   DW_AT_name        : ISR
    <14b>   DW_AT_decl_file   : 5
    <14c>   DW_AT_decl_line   : 244
    <14d>   DW_AT_decl_column : 17
    <14e>   DW_AT_type        : <0xd9>
    <152>   DW_AT_data_member_location: 0
 <2><153>: Abbrev Number: 11 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0x5e9ae): IFCR
    <158>   DW_AT_decl_file   : 5
    <159>   DW_AT_decl_line   : 245
    <15a>   DW_AT_decl_column : 17
    <15b>   DW_AT_type        : <0xd9>
    <15f>   DW_AT_data_member_location: 4
 <2><160>: Abbrev Number: 0
 <1><161>: Abbrev Number: 3 (DW_TAG_typedef)
    <162>   DW_AT_name        : (indirect string, offset: 0x30ca9): DMA_TypeDef
    <166>   DW_AT_decl_file   : 5
    <167>   DW_AT_decl_line   : 246
    <168>   DW_AT_decl_column : 3
    <169>   DW_AT_type        : <0x13d>
 <1><16d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <16e>   DW_AT_byte_size   : 44
    <16f>   DW_AT_decl_file   : 5
    <170>   DW_AT_decl_line   : 303
    <172>   DW_AT_decl_column : 9
    <173>   DW_AT_sibling     : <0x204>
 <2><177>: Abbrev Number: 13 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x105c): MODER
    <17c>   DW_AT_decl_file   : 5
    <17d>   DW_AT_decl_line   : 305
    <17f>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0xd9>
    <184>   DW_AT_data_member_location: 0
 <2><185>: Abbrev Number: 13 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0x68315): OTYPER
    <18a>   DW_AT_decl_file   : 5
    <18b>   DW_AT_decl_line   : 306
    <18d>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xd9>
    <192>   DW_AT_data_member_location: 4
 <2><193>: Abbrev Number: 13 (DW_TAG_member)
    <194>   DW_AT_name        : (indirect string, offset: 0x7572f): OSPEEDR
    <198>   DW_AT_decl_file   : 5
    <199>   DW_AT_decl_line   : 307
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0xd9>
    <1a0>   DW_AT_data_member_location: 8
 <2><1a1>: Abbrev Number: 13 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x6062a): PUPDR
    <1a6>   DW_AT_decl_file   : 5
    <1a7>   DW_AT_decl_line   : 308
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xd9>
    <1ae>   DW_AT_data_member_location: 12
 <2><1af>: Abbrev Number: 14 (DW_TAG_member)
    <1b0>   DW_AT_name        : IDR
    <1b4>   DW_AT_decl_file   : 5
    <1b5>   DW_AT_decl_line   : 309
    <1b7>   DW_AT_decl_column : 17
    <1b8>   DW_AT_type        : <0xd9>
    <1bc>   DW_AT_data_member_location: 16
 <2><1bd>: Abbrev Number: 14 (DW_TAG_member)
    <1be>   DW_AT_name        : ODR
    <1c2>   DW_AT_decl_file   : 5
    <1c3>   DW_AT_decl_line   : 310
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0xd9>
    <1ca>   DW_AT_data_member_location: 20
 <2><1cb>: Abbrev Number: 13 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x1ec59): BSRR
    <1d0>   DW_AT_decl_file   : 5
    <1d1>   DW_AT_decl_line   : 311
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xd9>
    <1d8>   DW_AT_data_member_location: 24
 <2><1d9>: Abbrev Number: 13 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x7377b): LCKR
    <1de>   DW_AT_decl_file   : 5
    <1df>   DW_AT_decl_line   : 312
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xd9>
    <1e6>   DW_AT_data_member_location: 28
 <2><1e7>: Abbrev Number: 14 (DW_TAG_member)
    <1e8>   DW_AT_name        : AFR
    <1ec>   DW_AT_decl_file   : 5
    <1ed>   DW_AT_decl_line   : 313
    <1ef>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0xee>
    <1f4>   DW_AT_data_member_location: 32
 <2><1f5>: Abbrev Number: 14 (DW_TAG_member)
    <1f6>   DW_AT_name        : BRR
    <1fa>   DW_AT_decl_file   : 5
    <1fb>   DW_AT_decl_line   : 314
    <1fd>   DW_AT_decl_column : 17
    <1fe>   DW_AT_type        : <0xd9>
    <202>   DW_AT_data_member_location: 40
 <2><203>: Abbrev Number: 0
 <1><204>: Abbrev Number: 15 (DW_TAG_typedef)
    <205>   DW_AT_name        : (indirect string, offset: 0x82a60): GPIO_TypeDef
    <209>   DW_AT_decl_file   : 5
    <20a>   DW_AT_decl_line   : 315
    <20c>   DW_AT_decl_column : 2
    <20d>   DW_AT_type        : <0x16d>
 <1><211>: Abbrev Number: 12 (DW_TAG_structure_type)
    <212>   DW_AT_byte_size   : 8
    <213>   DW_AT_decl_file   : 5
    <214>   DW_AT_decl_line   : 412
    <216>   DW_AT_decl_column : 9
    <217>   DW_AT_sibling     : <0x237>
 <2><21b>: Abbrev Number: 14 (DW_TAG_member)
    <21c>   DW_AT_name        : CR
    <21f>   DW_AT_decl_file   : 5
    <220>   DW_AT_decl_line   : 414
    <222>   DW_AT_decl_column : 17
    <223>   DW_AT_type        : <0xd9>
    <227>   DW_AT_data_member_location: 0
 <2><228>: Abbrev Number: 14 (DW_TAG_member)
    <229>   DW_AT_name        : CSR
    <22d>   DW_AT_decl_file   : 5
    <22e>   DW_AT_decl_line   : 415
    <230>   DW_AT_decl_column : 17
    <231>   DW_AT_type        : <0xd9>
    <235>   DW_AT_data_member_location: 4
 <2><236>: Abbrev Number: 0
 <1><237>: Abbrev Number: 15 (DW_TAG_typedef)
    <238>   DW_AT_name        : (indirect string, offset: 0xde5d): PWR_TypeDef
    <23c>   DW_AT_decl_file   : 5
    <23d>   DW_AT_decl_line   : 416
    <23f>   DW_AT_decl_column : 3
    <240>   DW_AT_type        : <0x211>
 <1><244>: Abbrev Number: 12 (DW_TAG_structure_type)
    <245>   DW_AT_byte_size   : 84
    <246>   DW_AT_decl_file   : 5
    <247>   DW_AT_decl_line   : 421
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_sibling     : <0x374>
 <2><24e>: Abbrev Number: 14 (DW_TAG_member)
    <24f>   DW_AT_name        : CR
    <252>   DW_AT_decl_file   : 5
    <253>   DW_AT_decl_line   : 423
    <255>   DW_AT_decl_column : 17
    <256>   DW_AT_type        : <0xd9>
    <25a>   DW_AT_data_member_location: 0
 <2><25b>: Abbrev Number: 13 (DW_TAG_member)
    <25c>   DW_AT_name        : (indirect string, offset: 0x4cea2): ICSCR
    <260>   DW_AT_decl_file   : 5
    <261>   DW_AT_decl_line   : 424
    <263>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0xd9>
    <268>   DW_AT_data_member_location: 4
 <2><269>: Abbrev Number: 13 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x24a91): CRRCR
    <26e>   DW_AT_decl_file   : 5
    <26f>   DW_AT_decl_line   : 425
    <271>   DW_AT_decl_column : 17
    <272>   DW_AT_type        : <0xd9>
    <276>   DW_AT_data_member_location: 8
 <2><277>: Abbrev Number: 13 (DW_TAG_member)
    <278>   DW_AT_name        : (indirect string, offset: 0x517b5): CFGR
    <27c>   DW_AT_decl_file   : 5
    <27d>   DW_AT_decl_line   : 426
    <27f>   DW_AT_decl_column : 17
    <280>   DW_AT_type        : <0xd9>
    <284>   DW_AT_data_member_location: 12
 <2><285>: Abbrev Number: 13 (DW_TAG_member)
    <286>   DW_AT_name        : (indirect string, offset: 0x1c7c): CIER
    <28a>   DW_AT_decl_file   : 5
    <28b>   DW_AT_decl_line   : 427
    <28d>   DW_AT_decl_column : 17
    <28e>   DW_AT_type        : <0xd9>
    <292>   DW_AT_data_member_location: 16
 <2><293>: Abbrev Number: 13 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0x231e): CIFR
    <298>   DW_AT_decl_file   : 5
    <299>   DW_AT_decl_line   : 428
    <29b>   DW_AT_decl_column : 17
    <29c>   DW_AT_type        : <0xd9>
    <2a0>   DW_AT_data_member_location: 20
 <2><2a1>: Abbrev Number: 13 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x86cc6): CICR
    <2a6>   DW_AT_decl_file   : 5
    <2a7>   DW_AT_decl_line   : 429
    <2a9>   DW_AT_decl_column : 17
    <2aa>   DW_AT_type        : <0xd9>
    <2ae>   DW_AT_data_member_location: 24
 <2><2af>: Abbrev Number: 13 (DW_TAG_member)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x5790): IOPRSTR
    <2b4>   DW_AT_decl_file   : 5
    <2b5>   DW_AT_decl_line   : 430
    <2b7>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xd9>
    <2bc>   DW_AT_data_member_location: 28
 <2><2bd>: Abbrev Number: 13 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0xb5c1): AHBRSTR
    <2c2>   DW_AT_decl_file   : 5
    <2c3>   DW_AT_decl_line   : 431
    <2c5>   DW_AT_decl_column : 17
    <2c6>   DW_AT_type        : <0xd9>
    <2ca>   DW_AT_data_member_location: 32
 <2><2cb>: Abbrev Number: 13 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x3aa38): APB2RSTR
    <2d0>   DW_AT_decl_file   : 5
    <2d1>   DW_AT_decl_line   : 432
    <2d3>   DW_AT_decl_column : 17
    <2d4>   DW_AT_type        : <0xd9>
    <2d8>   DW_AT_data_member_location: 36
 <2><2d9>: Abbrev Number: 13 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0xfc0e): APB1RSTR
    <2de>   DW_AT_decl_file   : 5
    <2df>   DW_AT_decl_line   : 433
    <2e1>   DW_AT_decl_column : 17
    <2e2>   DW_AT_type        : <0xd9>
    <2e6>   DW_AT_data_member_location: 40
 <2><2e7>: Abbrev Number: 13 (DW_TAG_member)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x353a0): IOPENR
    <2ec>   DW_AT_decl_file   : 5
    <2ed>   DW_AT_decl_line   : 434
    <2ef>   DW_AT_decl_column : 17
    <2f0>   DW_AT_type        : <0xd9>
    <2f4>   DW_AT_data_member_location: 44
 <2><2f5>: Abbrev Number: 13 (DW_TAG_member)
    <2f6>   DW_AT_name        : (indirect string, offset: 0xc85b): AHBENR
    <2fa>   DW_AT_decl_file   : 5
    <2fb>   DW_AT_decl_line   : 435
    <2fd>   DW_AT_decl_column : 17
    <2fe>   DW_AT_type        : <0xd9>
    <302>   DW_AT_data_member_location: 48
 <2><303>: Abbrev Number: 13 (DW_TAG_member)
    <304>   DW_AT_name        : (indirect string, offset: 0x1071c): APB2ENR
    <308>   DW_AT_decl_file   : 5
    <309>   DW_AT_decl_line   : 436
    <30b>   DW_AT_decl_column : 17
    <30c>   DW_AT_type        : <0xd9>
    <310>   DW_AT_data_member_location: 52
 <2><311>: Abbrev Number: 13 (DW_TAG_member)
    <312>   DW_AT_name        : (indirect string, offset: 0x65733): APB1ENR
    <316>   DW_AT_decl_file   : 5
    <317>   DW_AT_decl_line   : 437
    <319>   DW_AT_decl_column : 17
    <31a>   DW_AT_type        : <0xd9>
    <31e>   DW_AT_data_member_location: 56
 <2><31f>: Abbrev Number: 13 (DW_TAG_member)
    <320>   DW_AT_name        : (indirect string, offset: 0x64cbc): IOPSMENR
    <324>   DW_AT_decl_file   : 5
    <325>   DW_AT_decl_line   : 438
    <327>   DW_AT_decl_column : 17
    <328>   DW_AT_type        : <0xd9>
    <32c>   DW_AT_data_member_location: 60
 <2><32d>: Abbrev Number: 13 (DW_TAG_member)
    <32e>   DW_AT_name        : (indirect string, offset: 0x693a5): AHBSMENR
    <332>   DW_AT_decl_file   : 5
    <333>   DW_AT_decl_line   : 439
    <335>   DW_AT_decl_column : 17
    <336>   DW_AT_type        : <0xd9>
    <33a>   DW_AT_data_member_location: 64
 <2><33b>: Abbrev Number: 13 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x674fe): APB2SMENR
    <340>   DW_AT_decl_file   : 5
    <341>   DW_AT_decl_line   : 440
    <343>   DW_AT_decl_column : 17
    <344>   DW_AT_type        : <0xd9>
    <348>   DW_AT_data_member_location: 68
 <2><349>: Abbrev Number: 13 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x2fe40): APB1SMENR
    <34e>   DW_AT_decl_file   : 5
    <34f>   DW_AT_decl_line   : 441
    <351>   DW_AT_decl_column : 17
    <352>   DW_AT_type        : <0xd9>
    <356>   DW_AT_data_member_location: 72
 <2><357>: Abbrev Number: 13 (DW_TAG_member)
    <358>   DW_AT_name        : (indirect string, offset: 0x29748): CCIPR
    <35c>   DW_AT_decl_file   : 5
    <35d>   DW_AT_decl_line   : 442
    <35f>   DW_AT_decl_column : 17
    <360>   DW_AT_type        : <0xd9>
    <364>   DW_AT_data_member_location: 76
 <2><365>: Abbrev Number: 14 (DW_TAG_member)
    <366>   DW_AT_name        : CSR
    <36a>   DW_AT_decl_file   : 5
    <36b>   DW_AT_decl_line   : 443
    <36d>   DW_AT_decl_column : 17
    <36e>   DW_AT_type        : <0xd9>
    <372>   DW_AT_data_member_location: 80
 <2><373>: Abbrev Number: 0
 <1><374>: Abbrev Number: 15 (DW_TAG_typedef)
    <375>   DW_AT_name        : (indirect string, offset: 0x3e33d): RCC_TypeDef
    <379>   DW_AT_decl_file   : 5
    <37a>   DW_AT_decl_line   : 444
    <37c>   DW_AT_decl_column : 3
    <37d>   DW_AT_type        : <0x244>
 <1><381>: Abbrev Number: 12 (DW_TAG_structure_type)
    <382>   DW_AT_byte_size   : 84
    <383>   DW_AT_decl_file   : 5
    <384>   DW_AT_decl_line   : 508
    <386>   DW_AT_decl_column : 9
    <387>   DW_AT_sibling     : <0x4b0>
 <2><38b>: Abbrev Number: 14 (DW_TAG_member)
    <38c>   DW_AT_name        : CR1
    <390>   DW_AT_decl_file   : 5
    <391>   DW_AT_decl_line   : 510
    <393>   DW_AT_decl_column : 17
    <394>   DW_AT_type        : <0xd9>
    <398>   DW_AT_data_member_location: 0
 <2><399>: Abbrev Number: 14 (DW_TAG_member)
    <39a>   DW_AT_name        : CR2
    <39e>   DW_AT_decl_file   : 5
    <39f>   DW_AT_decl_line   : 511
    <3a1>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0xd9>
    <3a6>   DW_AT_data_member_location: 4
 <2><3a7>: Abbrev Number: 13 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x60d8a): SMCR
    <3ac>   DW_AT_decl_file   : 5
    <3ad>   DW_AT_decl_line   : 512
    <3af>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0xd9>
    <3b4>   DW_AT_data_member_location: 8
 <2><3b5>: Abbrev Number: 13 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x2b976): DIER
    <3ba>   DW_AT_decl_file   : 5
    <3bb>   DW_AT_decl_line   : 513
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0xd9>
    <3c2>   DW_AT_data_member_location: 12
 <2><3c3>: Abbrev Number: 14 (DW_TAG_member)
    <3c4>   DW_AT_name        : SR
    <3c7>   DW_AT_decl_file   : 5
    <3c8>   DW_AT_decl_line   : 514
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0xd9>
    <3cf>   DW_AT_data_member_location: 16
 <2><3d0>: Abbrev Number: 14 (DW_TAG_member)
    <3d1>   DW_AT_name        : EGR
    <3d5>   DW_AT_decl_file   : 5
    <3d6>   DW_AT_decl_line   : 515
    <3d8>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xd9>
    <3dd>   DW_AT_data_member_location: 20
 <2><3de>: Abbrev Number: 13 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x7b015): CCMR1
    <3e3>   DW_AT_decl_file   : 5
    <3e4>   DW_AT_decl_line   : 516
    <3e6>   DW_AT_decl_column : 17
    <3e7>   DW_AT_type        : <0xd9>
    <3eb>   DW_AT_data_member_location: 24
 <2><3ec>: Abbrev Number: 13 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x355f4): CCMR2
    <3f1>   DW_AT_decl_file   : 5
    <3f2>   DW_AT_decl_line   : 517
    <3f4>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xd9>
    <3f9>   DW_AT_data_member_location: 28
 <2><3fa>: Abbrev Number: 13 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x1ca51): CCER
    <3ff>   DW_AT_decl_file   : 5
    <400>   DW_AT_decl_line   : 518
    <402>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0xd9>
    <407>   DW_AT_data_member_location: 32
 <2><408>: Abbrev Number: 14 (DW_TAG_member)
    <409>   DW_AT_name        : CNT
    <40d>   DW_AT_decl_file   : 5
    <40e>   DW_AT_decl_line   : 519
    <410>   DW_AT_decl_column : 17
    <411>   DW_AT_type        : <0xd9>
    <415>   DW_AT_data_member_location: 36
 <2><416>: Abbrev Number: 14 (DW_TAG_member)
    <417>   DW_AT_name        : PSC
    <41b>   DW_AT_decl_file   : 5
    <41c>   DW_AT_decl_line   : 520
    <41e>   DW_AT_decl_column : 17
    <41f>   DW_AT_type        : <0xd9>
    <423>   DW_AT_data_member_location: 40
 <2><424>: Abbrev Number: 14 (DW_TAG_member)
    <425>   DW_AT_name        : ARR
    <429>   DW_AT_decl_file   : 5
    <42a>   DW_AT_decl_line   : 521
    <42c>   DW_AT_decl_column : 17
    <42d>   DW_AT_type        : <0xd9>
    <431>   DW_AT_data_member_location: 44
 <2><432>: Abbrev Number: 13 (DW_TAG_member)
    <433>   DW_AT_name        : (indirect string, offset: 0x12be0): RESERVED12
    <437>   DW_AT_decl_file   : 5
    <438>   DW_AT_decl_line   : 522
    <43a>   DW_AT_decl_column : 17
    <43b>   DW_AT_type        : <0xcd>
    <43f>   DW_AT_data_member_location: 48
 <2><440>: Abbrev Number: 13 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0x10717): CCR1
    <445>   DW_AT_decl_file   : 5
    <446>   DW_AT_decl_line   : 523
    <448>   DW_AT_decl_column : 17
    <449>   DW_AT_type        : <0xd9>
    <44d>   DW_AT_data_member_location: 52
 <2><44e>: Abbrev Number: 13 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0x38621): CCR2
    <453>   DW_AT_decl_file   : 5
    <454>   DW_AT_decl_line   : 524
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0xd9>
    <45b>   DW_AT_data_member_location: 56
 <2><45c>: Abbrev Number: 13 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x66f6e): CCR3
    <461>   DW_AT_decl_file   : 5
    <462>   DW_AT_decl_line   : 525
    <464>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0xd9>
    <469>   DW_AT_data_member_location: 60
 <2><46a>: Abbrev Number: 13 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x89a1): CCR4
    <46f>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 526
    <472>   DW_AT_decl_column : 17
    <473>   DW_AT_type        : <0xd9>
    <477>   DW_AT_data_member_location: 64
 <2><478>: Abbrev Number: 13 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x12beb): RESERVED17
    <47d>   DW_AT_decl_file   : 5
    <47e>   DW_AT_decl_line   : 527
    <480>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0xcd>
    <485>   DW_AT_data_member_location: 68
 <2><486>: Abbrev Number: 14 (DW_TAG_member)
    <487>   DW_AT_name        : DCR
    <48b>   DW_AT_decl_file   : 5
    <48c>   DW_AT_decl_line   : 528
    <48e>   DW_AT_decl_column : 17
    <48f>   DW_AT_type        : <0xd9>
    <493>   DW_AT_data_member_location: 72
 <2><494>: Abbrev Number: 13 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0x641a4): DMAR
    <499>   DW_AT_decl_file   : 5
    <49a>   DW_AT_decl_line   : 529
    <49c>   DW_AT_decl_column : 17
    <49d>   DW_AT_type        : <0xd9>
    <4a1>   DW_AT_data_member_location: 76
 <2><4a2>: Abbrev Number: 14 (DW_TAG_member)
    <4a3>   DW_AT_name        : OR
    <4a6>   DW_AT_decl_file   : 5
    <4a7>   DW_AT_decl_line   : 530
    <4a9>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0xd9>
    <4ae>   DW_AT_data_member_location: 80
 <2><4af>: Abbrev Number: 0
 <1><4b0>: Abbrev Number: 15 (DW_TAG_typedef)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x7f2b0): TIM_TypeDef
    <4b5>   DW_AT_decl_file   : 5
    <4b6>   DW_AT_decl_line   : 531
    <4b8>   DW_AT_decl_column : 3
    <4b9>   DW_AT_type        : <0x381>
 <1><4bd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <4be>   DW_AT_byte_size   : 44
    <4bf>   DW_AT_decl_file   : 5
    <4c0>   DW_AT_decl_line   : 557
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_sibling     : <0x562>
 <2><4c7>: Abbrev Number: 14 (DW_TAG_member)
    <4c8>   DW_AT_name        : CR1
    <4cc>   DW_AT_decl_file   : 5
    <4cd>   DW_AT_decl_line   : 559
    <4cf>   DW_AT_decl_column : 17
    <4d0>   DW_AT_type        : <0xd9>
    <4d4>   DW_AT_data_member_location: 0
 <2><4d5>: Abbrev Number: 14 (DW_TAG_member)
    <4d6>   DW_AT_name        : CR2
    <4da>   DW_AT_decl_file   : 5
    <4db>   DW_AT_decl_line   : 560
    <4dd>   DW_AT_decl_column : 17
    <4de>   DW_AT_type        : <0xd9>
    <4e2>   DW_AT_data_member_location: 4
 <2><4e3>: Abbrev Number: 14 (DW_TAG_member)
    <4e4>   DW_AT_name        : CR3
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 561
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0xd9>
    <4f0>   DW_AT_data_member_location: 8
 <2><4f1>: Abbrev Number: 14 (DW_TAG_member)
    <4f2>   DW_AT_name        : BRR
    <4f6>   DW_AT_decl_file   : 5
    <4f7>   DW_AT_decl_line   : 562
    <4f9>   DW_AT_decl_column : 17
    <4fa>   DW_AT_type        : <0xd9>
    <4fe>   DW_AT_data_member_location: 12
 <2><4ff>: Abbrev Number: 13 (DW_TAG_member)
    <500>   DW_AT_name        : (indirect string, offset: 0x2599c): GTPR
    <504>   DW_AT_decl_file   : 5
    <505>   DW_AT_decl_line   : 563
    <507>   DW_AT_decl_column : 17
    <508>   DW_AT_type        : <0xd9>
    <50c>   DW_AT_data_member_location: 16
 <2><50d>: Abbrev Number: 13 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x286ad): RTOR
    <512>   DW_AT_decl_file   : 5
    <513>   DW_AT_decl_line   : 564
    <515>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0xd9>
    <51a>   DW_AT_data_member_location: 20
 <2><51b>: Abbrev Number: 14 (DW_TAG_member)
    <51c>   DW_AT_name        : RQR
    <520>   DW_AT_decl_file   : 5
    <521>   DW_AT_decl_line   : 565
    <523>   DW_AT_decl_column : 17
    <524>   DW_AT_type        : <0xd9>
    <528>   DW_AT_data_member_location: 24
 <2><529>: Abbrev Number: 14 (DW_TAG_member)
    <52a>   DW_AT_name        : ISR
    <52e>   DW_AT_decl_file   : 5
    <52f>   DW_AT_decl_line   : 566
    <531>   DW_AT_decl_column : 17
    <532>   DW_AT_type        : <0xd9>
    <536>   DW_AT_data_member_location: 28
 <2><537>: Abbrev Number: 14 (DW_TAG_member)
    <538>   DW_AT_name        : ICR
    <53c>   DW_AT_decl_file   : 5
    <53d>   DW_AT_decl_line   : 567
    <53f>   DW_AT_decl_column : 17
    <540>   DW_AT_type        : <0xd9>
    <544>   DW_AT_data_member_location: 32
 <2><545>: Abbrev Number: 14 (DW_TAG_member)
    <546>   DW_AT_name        : RDR
    <54a>   DW_AT_decl_file   : 5
    <54b>   DW_AT_decl_line   : 568
    <54d>   DW_AT_decl_column : 17
    <54e>   DW_AT_type        : <0xd9>
    <552>   DW_AT_data_member_location: 36
 <2><553>: Abbrev Number: 14 (DW_TAG_member)
    <554>   DW_AT_name        : TDR
    <558>   DW_AT_decl_file   : 5
    <559>   DW_AT_decl_line   : 569
    <55b>   DW_AT_decl_column : 17
    <55c>   DW_AT_type        : <0xd9>
    <560>   DW_AT_data_member_location: 40
 <2><561>: Abbrev Number: 0
 <1><562>: Abbrev Number: 15 (DW_TAG_typedef)
    <563>   DW_AT_name        : (indirect string, offset: 0x855c7): USART_TypeDef
    <567>   DW_AT_decl_file   : 5
    <568>   DW_AT_decl_line   : 570
    <56a>   DW_AT_decl_column : 3
    <56b>   DW_AT_type        : <0x4bd>
 <1><56f>: Abbrev Number: 2 (DW_TAG_base_type)
    <570>   DW_AT_byte_size   : 8
    <571>   DW_AT_encoding    : 4	(float)
    <572>   DW_AT_name        : (indirect string, offset: 0x6e7d0): long double
 <1><576>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <577>   DW_AT_encoding    : 7	(unsigned)
    <578>   DW_AT_byte_size   : 1
    <579>   DW_AT_type        : <0x3c>
    <57d>   DW_AT_decl_file   : 6
    <57e>   DW_AT_decl_line   : 39
    <57f>   DW_AT_decl_column : 1
    <580>   DW_AT_sibling     : <0x59d>
 <2><584>: Abbrev Number: 17 (DW_TAG_enumerator)
    <585>   DW_AT_name        : (indirect string, offset: 0x2d792): HAL_OK
    <589>   DW_AT_const_value : 0
 <2><58a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <58b>   DW_AT_name        : (indirect string, offset: 0x54650): HAL_ERROR
    <58f>   DW_AT_const_value : 1
 <2><590>: Abbrev Number: 17 (DW_TAG_enumerator)
    <591>   DW_AT_name        : (indirect string, offset: 0x185f1): HAL_BUSY
    <595>   DW_AT_const_value : 2
 <2><596>: Abbrev Number: 17 (DW_TAG_enumerator)
    <597>   DW_AT_name        : (indirect string, offset: 0x27b65): HAL_TIMEOUT
    <59b>   DW_AT_const_value : 3
 <2><59c>: Abbrev Number: 0
 <1><59d>: Abbrev Number: 3 (DW_TAG_typedef)
    <59e>   DW_AT_name        : (indirect string, offset: 0x70aa2): HAL_StatusTypeDef
    <5a2>   DW_AT_decl_file   : 6
    <5a3>   DW_AT_decl_line   : 44
    <5a4>   DW_AT_decl_column : 3
    <5a5>   DW_AT_type        : <0x576>
 <1><5a9>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <5aa>   DW_AT_encoding    : 7	(unsigned)
    <5ab>   DW_AT_byte_size   : 1
    <5ac>   DW_AT_type        : <0x3c>
    <5b0>   DW_AT_decl_file   : 6
    <5b1>   DW_AT_decl_line   : 50
    <5b2>   DW_AT_decl_column : 1
    <5b3>   DW_AT_sibling     : <0x5c4>
 <2><5b7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x639d4): HAL_UNLOCKED
    <5bc>   DW_AT_const_value : 0
 <2><5bd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5be>   DW_AT_name        : (indirect string, offset: 0x86545): HAL_LOCKED
    <5c2>   DW_AT_const_value : 1
 <2><5c3>: Abbrev Number: 0
 <1><5c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x522ab): HAL_LockTypeDef
    <5c9>   DW_AT_decl_file   : 6
    <5ca>   DW_AT_decl_line   : 53
    <5cb>   DW_AT_decl_column : 3
    <5cc>   DW_AT_type        : <0x5a9>
 <1><5d0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5d1>   DW_AT_byte_size   : 16
    <5d2>   DW_AT_decl_file   : 7
    <5d3>   DW_AT_decl_line   : 217
    <5d4>   DW_AT_decl_column : 9
    <5d5>   DW_AT_sibling     : <0x60e>
 <2><5d9>: Abbrev Number: 11 (DW_TAG_member)
    <5da>   DW_AT_name        : (indirect string, offset: 0x5a6eb): PLLState
    <5de>   DW_AT_decl_file   : 7
    <5df>   DW_AT_decl_line   : 219
    <5e0>   DW_AT_decl_column : 12
    <5e1>   DW_AT_type        : <0xcd>
    <5e5>   DW_AT_data_member_location: 0
 <2><5e6>: Abbrev Number: 11 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x5bb0c): PLLSource
    <5eb>   DW_AT_decl_file   : 7
    <5ec>   DW_AT_decl_line   : 222
    <5ed>   DW_AT_decl_column : 12
    <5ee>   DW_AT_type        : <0xcd>
    <5f2>   DW_AT_data_member_location: 4
 <2><5f3>: Abbrev Number: 11 (DW_TAG_member)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x34c0b): PLLMUL
    <5f8>   DW_AT_decl_file   : 7
    <5f9>   DW_AT_decl_line   : 225
    <5fa>   DW_AT_decl_column : 12
    <5fb>   DW_AT_type        : <0xcd>
    <5ff>   DW_AT_data_member_location: 8
 <2><600>: Abbrev Number: 11 (DW_TAG_member)
    <601>   DW_AT_name        : (indirect string, offset: 0x5639a): PLLDIV
    <605>   DW_AT_decl_file   : 7
    <606>   DW_AT_decl_line   : 228
    <607>   DW_AT_decl_column : 12
    <608>   DW_AT_type        : <0xcd>
    <60c>   DW_AT_data_member_location: 12
 <2><60d>: Abbrev Number: 0
 <1><60e>: Abbrev Number: 3 (DW_TAG_typedef)
    <60f>   DW_AT_name        : (indirect string, offset: 0x51312): RCC_PLLInitTypeDef
    <613>   DW_AT_decl_file   : 7
    <614>   DW_AT_decl_line   : 230
    <615>   DW_AT_decl_column : 3
    <616>   DW_AT_type        : <0x5d0>
 <1><61a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <61b>   DW_AT_byte_size   : 56
    <61c>   DW_AT_decl_file   : 7
    <61d>   DW_AT_decl_line   : 235
    <61e>   DW_AT_decl_column : 9
    <61f>   DW_AT_sibling     : <0x6b8>
 <2><623>: Abbrev Number: 11 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x6d9fe): OscillatorType
    <628>   DW_AT_decl_file   : 7
    <629>   DW_AT_decl_line   : 237
    <62a>   DW_AT_decl_column : 12
    <62b>   DW_AT_type        : <0xcd>
    <62f>   DW_AT_data_member_location: 0
 <2><630>: Abbrev Number: 11 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x5b9b5): HSEState
    <635>   DW_AT_decl_file   : 7
    <636>   DW_AT_decl_line   : 240
    <637>   DW_AT_decl_column : 12
    <638>   DW_AT_type        : <0xcd>
    <63c>   DW_AT_data_member_location: 4
 <2><63d>: Abbrev Number: 11 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x3431a): LSEState
    <642>   DW_AT_decl_file   : 7
    <643>   DW_AT_decl_line   : 243
    <644>   DW_AT_decl_column : 12
    <645>   DW_AT_type        : <0xcd>
    <649>   DW_AT_data_member_location: 8
 <2><64a>: Abbrev Number: 11 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0x3c31c): HSIState
    <64f>   DW_AT_decl_file   : 7
    <650>   DW_AT_decl_line   : 246
    <651>   DW_AT_decl_column : 12
    <652>   DW_AT_type        : <0xcd>
    <656>   DW_AT_data_member_location: 12
 <2><657>: Abbrev Number: 11 (DW_TAG_member)
    <658>   DW_AT_name        : (indirect string, offset: 0x73d07): HSICalibrationValue
    <65c>   DW_AT_decl_file   : 7
    <65d>   DW_AT_decl_line   : 249
    <65e>   DW_AT_decl_column : 12
    <65f>   DW_AT_type        : <0xcd>
    <663>   DW_AT_data_member_location: 16
 <2><664>: Abbrev Number: 11 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0x78609): LSIState
    <669>   DW_AT_decl_file   : 7
    <66a>   DW_AT_decl_line   : 252
    <66b>   DW_AT_decl_column : 12
    <66c>   DW_AT_type        : <0xcd>
    <670>   DW_AT_data_member_location: 20
 <2><671>: Abbrev Number: 13 (DW_TAG_member)
    <672>   DW_AT_name        : (indirect string, offset: 0x5fd33): HSI48State
    <676>   DW_AT_decl_file   : 7
    <677>   DW_AT_decl_line   : 256
    <679>   DW_AT_decl_column : 12
    <67a>   DW_AT_type        : <0xcd>
    <67e>   DW_AT_data_member_location: 24
 <2><67f>: Abbrev Number: 13 (DW_TAG_member)
    <680>   DW_AT_name        : (indirect string, offset: 0x6e829): MSIState
    <684>   DW_AT_decl_file   : 7
    <685>   DW_AT_decl_line   : 260
    <687>   DW_AT_decl_column : 12
    <688>   DW_AT_type        : <0xcd>
    <68c>   DW_AT_data_member_location: 28
 <2><68d>: Abbrev Number: 13 (DW_TAG_member)
    <68e>   DW_AT_name        : (indirect string, offset: 0x2d374): MSICalibrationValue
    <692>   DW_AT_decl_file   : 7
    <693>   DW_AT_decl_line   : 263
    <695>   DW_AT_decl_column : 12
    <696>   DW_AT_type        : <0xcd>
    <69a>   DW_AT_data_member_location: 32
 <2><69b>: Abbrev Number: 13 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0x45369): MSIClockRange
    <6a0>   DW_AT_decl_file   : 7
    <6a1>   DW_AT_decl_line   : 266
    <6a3>   DW_AT_decl_column : 12
    <6a4>   DW_AT_type        : <0xcd>
    <6a8>   DW_AT_data_member_location: 36
 <2><6a9>: Abbrev Number: 14 (DW_TAG_member)
    <6aa>   DW_AT_name        : PLL
    <6ae>   DW_AT_decl_file   : 7
    <6af>   DW_AT_decl_line   : 269
    <6b1>   DW_AT_decl_column : 22
    <6b2>   DW_AT_type        : <0x60e>
    <6b6>   DW_AT_data_member_location: 40
 <2><6b7>: Abbrev Number: 0
 <1><6b8>: Abbrev Number: 15 (DW_TAG_typedef)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x47a6a): RCC_OscInitTypeDef
    <6bd>   DW_AT_decl_file   : 7
    <6be>   DW_AT_decl_line   : 271
    <6c0>   DW_AT_decl_column : 3
    <6c1>   DW_AT_type        : <0x61a>
 <1><6c5>: Abbrev Number: 12 (DW_TAG_structure_type)
    <6c6>   DW_AT_byte_size   : 20
    <6c7>   DW_AT_decl_file   : 7
    <6c8>   DW_AT_decl_line   : 276
    <6ca>   DW_AT_decl_column : 9
    <6cb>   DW_AT_sibling     : <0x716>
 <2><6cf>: Abbrev Number: 13 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0x2974e): ClockType
    <6d4>   DW_AT_decl_file   : 7
    <6d5>   DW_AT_decl_line   : 278
    <6d7>   DW_AT_decl_column : 12
    <6d8>   DW_AT_type        : <0xcd>
    <6dc>   DW_AT_data_member_location: 0
 <2><6dd>: Abbrev Number: 13 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x51054): SYSCLKSource
    <6e2>   DW_AT_decl_file   : 7
    <6e3>   DW_AT_decl_line   : 281
    <6e5>   DW_AT_decl_column : 12
    <6e6>   DW_AT_type        : <0xcd>
    <6ea>   DW_AT_data_member_location: 4
 <2><6eb>: Abbrev Number: 13 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x6f4fd): AHBCLKDivider
    <6f0>   DW_AT_decl_file   : 7
    <6f1>   DW_AT_decl_line   : 284
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xcd>
    <6f8>   DW_AT_data_member_location: 8
 <2><6f9>: Abbrev Number: 13 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0x55ec): APB1CLKDivider
    <6fe>   DW_AT_decl_file   : 7
    <6ff>   DW_AT_decl_line   : 287
    <701>   DW_AT_decl_column : 12
    <702>   DW_AT_type        : <0xcd>
    <706>   DW_AT_data_member_location: 12
 <2><707>: Abbrev Number: 13 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x3da52): APB2CLKDivider
    <70c>   DW_AT_decl_file   : 7
    <70d>   DW_AT_decl_line   : 290
    <70f>   DW_AT_decl_column : 12
    <710>   DW_AT_type        : <0xcd>
    <714>   DW_AT_data_member_location: 16
 <2><715>: Abbrev Number: 0
 <1><716>: Abbrev Number: 15 (DW_TAG_typedef)
    <717>   DW_AT_name        : (indirect string, offset: 0x67de2): RCC_ClkInitTypeDef
    <71b>   DW_AT_decl_file   : 7
    <71c>   DW_AT_decl_line   : 292
    <71e>   DW_AT_decl_column : 3
    <71f>   DW_AT_type        : <0x6c5>
 <1><723>: Abbrev Number: 9 (DW_TAG_structure_type)
    <724>   DW_AT_byte_size   : 40
    <725>   DW_AT_decl_file   : 8
    <726>   DW_AT_decl_line   : 173
    <727>   DW_AT_decl_column : 9
    <728>   DW_AT_sibling     : <0x7af>
 <2><72c>: Abbrev Number: 11 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0x71d54): PeriphClockSelection
    <731>   DW_AT_decl_file   : 8
    <732>   DW_AT_decl_line   : 175
    <733>   DW_AT_decl_column : 12
    <734>   DW_AT_type        : <0xcd>
    <738>   DW_AT_data_member_location: 0
 <2><739>: Abbrev Number: 11 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x2614): RTCClockSelection
    <73e>   DW_AT_decl_file   : 8
    <73f>   DW_AT_decl_line   : 178
    <740>   DW_AT_decl_column : 12
    <741>   DW_AT_type        : <0xcd>
    <745>   DW_AT_data_member_location: 4
 <2><746>: Abbrev Number: 11 (DW_TAG_member)
    <747>   DW_AT_name        : (indirect string, offset: 0x12e93): LCDClockSelection
    <74b>   DW_AT_decl_file   : 8
    <74c>   DW_AT_decl_line   : 183
    <74d>   DW_AT_decl_column : 12
    <74e>   DW_AT_type        : <0xcd>
    <752>   DW_AT_data_member_location: 8
 <2><753>: Abbrev Number: 11 (DW_TAG_member)
    <754>   DW_AT_name        : (indirect string, offset: 0x48e51): Usart1ClockSelection
    <758>   DW_AT_decl_file   : 8
    <759>   DW_AT_decl_line   : 188
    <75a>   DW_AT_decl_column : 12
    <75b>   DW_AT_type        : <0xcd>
    <75f>   DW_AT_data_member_location: 12
 <2><760>: Abbrev Number: 11 (DW_TAG_member)
    <761>   DW_AT_name        : (indirect string, offset: 0x6792a): Usart2ClockSelection
    <765>   DW_AT_decl_file   : 8
    <766>   DW_AT_decl_line   : 191
    <767>   DW_AT_decl_column : 12
    <768>   DW_AT_type        : <0xcd>
    <76c>   DW_AT_data_member_location: 16
 <2><76d>: Abbrev Number: 11 (DW_TAG_member)
    <76e>   DW_AT_name        : (indirect string, offset: 0x800f7): Lpuart1ClockSelection
    <772>   DW_AT_decl_file   : 8
    <773>   DW_AT_decl_line   : 194
    <774>   DW_AT_decl_column : 12
    <775>   DW_AT_type        : <0xcd>
    <779>   DW_AT_data_member_location: 20
 <2><77a>: Abbrev Number: 11 (DW_TAG_member)
    <77b>   DW_AT_name        : (indirect string, offset: 0x629d0): I2c1ClockSelection
    <77f>   DW_AT_decl_file   : 8
    <780>   DW_AT_decl_line   : 197
    <781>   DW_AT_decl_column : 12
    <782>   DW_AT_type        : <0xcd>
    <786>   DW_AT_data_member_location: 24
 <2><787>: Abbrev Number: 11 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x254a4): I2c3ClockSelection
    <78c>   DW_AT_decl_file   : 8
    <78d>   DW_AT_decl_line   : 201
    <78e>   DW_AT_decl_column : 12
    <78f>   DW_AT_type        : <0xcd>
    <793>   DW_AT_data_member_location: 28
 <2><794>: Abbrev Number: 11 (DW_TAG_member)
    <795>   DW_AT_name        : (indirect string, offset: 0x691c8): LptimClockSelection
    <799>   DW_AT_decl_file   : 8
    <79a>   DW_AT_decl_line   : 204
    <79b>   DW_AT_decl_column : 12
    <79c>   DW_AT_type        : <0xcd>
    <7a0>   DW_AT_data_member_location: 32
 <2><7a1>: Abbrev Number: 11 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0x103ac): UsbClockSelection
    <7a6>   DW_AT_decl_file   : 8
    <7a7>   DW_AT_decl_line   : 207
    <7a8>   DW_AT_decl_column : 12
    <7a9>   DW_AT_type        : <0xcd>
    <7ad>   DW_AT_data_member_location: 36
 <2><7ae>: Abbrev Number: 0
 <1><7af>: Abbrev Number: 3 (DW_TAG_typedef)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x53c21): RCC_PeriphCLKInitTypeDef
    <7b4>   DW_AT_decl_file   : 8
    <7b5>   DW_AT_decl_line   : 210
    <7b6>   DW_AT_decl_column : 3
    <7b7>   DW_AT_type        : <0x723>
 <1><7bb>: Abbrev Number: 9 (DW_TAG_structure_type)
    <7bc>   DW_AT_byte_size   : 20
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 51
    <7bf>   DW_AT_decl_column : 9
    <7c0>   DW_AT_sibling     : <0x806>
 <2><7c4>: Abbrev Number: 10 (DW_TAG_member)
    <7c5>   DW_AT_name        : Pin
    <7c9>   DW_AT_decl_file   : 9
    <7ca>   DW_AT_decl_line   : 53
    <7cb>   DW_AT_decl_column : 12
    <7cc>   DW_AT_type        : <0xcd>
    <7d0>   DW_AT_data_member_location: 0
 <2><7d1>: Abbrev Number: 11 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x89baf): Mode
    <7d6>   DW_AT_decl_file   : 9
    <7d7>   DW_AT_decl_line   : 56
    <7d8>   DW_AT_decl_column : 12
    <7d9>   DW_AT_type        : <0xcd>
    <7dd>   DW_AT_data_member_location: 4
 <2><7de>: Abbrev Number: 11 (DW_TAG_member)
    <7df>   DW_AT_name        : (indirect string, offset: 0x2db3): Pull
    <7e3>   DW_AT_decl_file   : 9
    <7e4>   DW_AT_decl_line   : 59
    <7e5>   DW_AT_decl_column : 12
    <7e6>   DW_AT_type        : <0xcd>
    <7ea>   DW_AT_data_member_location: 8
 <2><7eb>: Abbrev Number: 11 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x4eb8f): Speed
    <7f0>   DW_AT_decl_file   : 9
    <7f1>   DW_AT_decl_line   : 62
    <7f2>   DW_AT_decl_column : 12
    <7f3>   DW_AT_type        : <0xcd>
    <7f7>   DW_AT_data_member_location: 12
 <2><7f8>: Abbrev Number: 11 (DW_TAG_member)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x3da14): Alternate
    <7fd>   DW_AT_decl_file   : 9
    <7fe>   DW_AT_decl_line   : 65
    <7ff>   DW_AT_decl_column : 12
    <800>   DW_AT_type        : <0xcd>
    <804>   DW_AT_data_member_location: 16
 <2><805>: Abbrev Number: 0
 <1><806>: Abbrev Number: 3 (DW_TAG_typedef)
    <807>   DW_AT_name        : (indirect string, offset: 0x696eb): GPIO_InitTypeDef
    <80b>   DW_AT_decl_file   : 9
    <80c>   DW_AT_decl_line   : 67
    <80d>   DW_AT_decl_column : 3
    <80e>   DW_AT_type        : <0x7bb>
 <1><812>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <813>   DW_AT_encoding    : 7	(unsigned)
    <814>   DW_AT_byte_size   : 1
    <815>   DW_AT_type        : <0x3c>
    <819>   DW_AT_decl_file   : 9
    <81a>   DW_AT_decl_line   : 79
    <81b>   DW_AT_decl_column : 1
    <81c>   DW_AT_sibling     : <0x82d>
 <2><820>: Abbrev Number: 17 (DW_TAG_enumerator)
    <821>   DW_AT_name        : (indirect string, offset: 0x1c42a): GPIO_PIN_RESET
    <825>   DW_AT_const_value : 0
 <2><826>: Abbrev Number: 17 (DW_TAG_enumerator)
    <827>   DW_AT_name        : (indirect string, offset: 0xdb96): GPIO_PIN_SET
    <82b>   DW_AT_const_value : 1
 <2><82c>: Abbrev Number: 0
 <1><82d>: Abbrev Number: 3 (DW_TAG_typedef)
    <82e>   DW_AT_name        : (indirect string, offset: 0x844c1): GPIO_PinState
    <832>   DW_AT_decl_file   : 9
    <833>   DW_AT_decl_line   : 82
    <834>   DW_AT_decl_column : 3
    <835>   DW_AT_type        : <0x812>
 <1><839>: Abbrev Number: 9 (DW_TAG_structure_type)
    <83a>   DW_AT_byte_size   : 32
    <83b>   DW_AT_decl_file   : 10
    <83c>   DW_AT_decl_line   : 46
    <83d>   DW_AT_decl_column : 9
    <83e>   DW_AT_sibling     : <0x8ab>
 <2><842>: Abbrev Number: 11 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x78d62): Request
    <847>   DW_AT_decl_file   : 10
    <848>   DW_AT_decl_line   : 48
    <849>   DW_AT_decl_column : 12
    <84a>   DW_AT_type        : <0xcd>
    <84e>   DW_AT_data_member_location: 0
 <2><84f>: Abbrev Number: 11 (DW_TAG_member)
    <850>   DW_AT_name        : (indirect string, offset: 0x898a6): Direction
    <854>   DW_AT_decl_file   : 10
    <855>   DW_AT_decl_line   : 51
    <856>   DW_AT_decl_column : 12
    <857>   DW_AT_type        : <0xcd>
    <85b>   DW_AT_data_member_location: 4
 <2><85c>: Abbrev Number: 11 (DW_TAG_member)
    <85d>   DW_AT_name        : (indirect string, offset: 0x9410): PeriphInc
    <861>   DW_AT_decl_file   : 10
    <862>   DW_AT_decl_line   : 55
    <863>   DW_AT_decl_column : 12
    <864>   DW_AT_type        : <0xcd>
    <868>   DW_AT_data_member_location: 8
 <2><869>: Abbrev Number: 11 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x15886): MemInc
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 58
    <870>   DW_AT_decl_column : 12
    <871>   DW_AT_type        : <0xcd>
    <875>   DW_AT_data_member_location: 12
 <2><876>: Abbrev Number: 11 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0x42e78): PeriphDataAlignment
    <87b>   DW_AT_decl_file   : 10
    <87c>   DW_AT_decl_line   : 61
    <87d>   DW_AT_decl_column : 12
    <87e>   DW_AT_type        : <0xcd>
    <882>   DW_AT_data_member_location: 16
 <2><883>: Abbrev Number: 11 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0x79c1c): MemDataAlignment
    <888>   DW_AT_decl_file   : 10
    <889>   DW_AT_decl_line   : 64
    <88a>   DW_AT_decl_column : 12
    <88b>   DW_AT_type        : <0xcd>
    <88f>   DW_AT_data_member_location: 20
 <2><890>: Abbrev Number: 11 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x89baf): Mode
    <895>   DW_AT_decl_file   : 10
    <896>   DW_AT_decl_line   : 67
    <897>   DW_AT_decl_column : 12
    <898>   DW_AT_type        : <0xcd>
    <89c>   DW_AT_data_member_location: 24
 <2><89d>: Abbrev Number: 11 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0x88eeb): Priority
    <8a2>   DW_AT_decl_file   : 10
    <8a3>   DW_AT_decl_line   : 72
    <8a4>   DW_AT_decl_column : 12
    <8a5>   DW_AT_type        : <0xcd>
    <8a9>   DW_AT_data_member_location: 28
 <2><8aa>: Abbrev Number: 0
 <1><8ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x24612): DMA_InitTypeDef
    <8b0>   DW_AT_decl_file   : 10
    <8b1>   DW_AT_decl_line   : 74
    <8b2>   DW_AT_decl_column : 3
    <8b3>   DW_AT_type        : <0x839>
 <1><8b7>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <8b8>   DW_AT_encoding    : 7	(unsigned)
    <8b9>   DW_AT_byte_size   : 1
    <8ba>   DW_AT_type        : <0x3c>
    <8be>   DW_AT_decl_file   : 10
    <8bf>   DW_AT_decl_line   : 80
    <8c0>   DW_AT_decl_column : 1
    <8c1>   DW_AT_sibling     : <0x8de>
 <2><8c5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x647d7): HAL_DMA_STATE_RESET
    <8ca>   DW_AT_const_value : 0
 <2><8cb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x2544e): HAL_DMA_STATE_READY
    <8d0>   DW_AT_const_value : 1
 <2><8d1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x5db8a): HAL_DMA_STATE_BUSY
    <8d6>   DW_AT_const_value : 2
 <2><8d7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x846a2): HAL_DMA_STATE_TIMEOUT
    <8dc>   DW_AT_const_value : 3
 <2><8dd>: Abbrev Number: 0
 <1><8de>: Abbrev Number: 3 (DW_TAG_typedef)
    <8df>   DW_AT_name        : (indirect string, offset: 0x59e34): HAL_DMA_StateTypeDef
    <8e3>   DW_AT_decl_file   : 10
    <8e4>   DW_AT_decl_line   : 85
    <8e5>   DW_AT_decl_column : 2
    <8e6>   DW_AT_type        : <0x8b7>
 <1><8ea>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8eb>   DW_AT_type        : <0x8de>
 <1><8ef>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x72a1f): __DMA_HandleTypeDef
    <8f4>   DW_AT_byte_size   : 72
    <8f5>   DW_AT_decl_file   : 10
    <8f6>   DW_AT_decl_line   : 112
    <8f7>   DW_AT_decl_column : 16
    <8f8>   DW_AT_sibling     : <0x999>
 <2><8fc>: Abbrev Number: 11 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x340e8): Instance
    <901>   DW_AT_decl_file   : 10
    <902>   DW_AT_decl_line   : 114
    <903>   DW_AT_decl_column : 27
    <904>   DW_AT_type        : <0x999>
    <908>   DW_AT_data_member_location: 0
 <2><909>: Abbrev Number: 11 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x89384): Init
    <90e>   DW_AT_decl_file   : 10
    <90f>   DW_AT_decl_line   : 116
    <910>   DW_AT_decl_column : 25
    <911>   DW_AT_type        : <0x8ab>
    <915>   DW_AT_data_member_location: 4
 <2><916>: Abbrev Number: 11 (DW_TAG_member)
    <917>   DW_AT_name        : (indirect string, offset: 0x6018e): Lock
    <91b>   DW_AT_decl_file   : 10
    <91c>   DW_AT_decl_line   : 118
    <91d>   DW_AT_decl_column : 25
    <91e>   DW_AT_type        : <0x5c4>
    <922>   DW_AT_data_member_location: 36
 <2><923>: Abbrev Number: 11 (DW_TAG_member)
    <924>   DW_AT_name        : (indirect string, offset: 0x5fd38): State
    <928>   DW_AT_decl_file   : 10
    <929>   DW_AT_decl_line   : 120
    <92a>   DW_AT_decl_column : 30
    <92b>   DW_AT_type        : <0x8ea>
    <92f>   DW_AT_data_member_location: 37
 <2><930>: Abbrev Number: 11 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x7fb6d): Parent
    <935>   DW_AT_decl_file   : 10
    <936>   DW_AT_decl_line   : 122
    <937>   DW_AT_decl_column : 26
    <938>   DW_AT_type        : <0x99f>
    <93c>   DW_AT_data_member_location: 40
 <2><93d>: Abbrev Number: 11 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x85f71): XferCpltCallback
    <942>   DW_AT_decl_file   : 10
    <943>   DW_AT_decl_line   : 124
    <944>   DW_AT_decl_column : 28
    <945>   DW_AT_type        : <0x9b2>
    <949>   DW_AT_data_member_location: 44
 <2><94a>: Abbrev Number: 11 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x68bd9): XferHalfCpltCallback
    <94f>   DW_AT_decl_file   : 10
    <950>   DW_AT_decl_line   : 126
    <951>   DW_AT_decl_column : 28
    <952>   DW_AT_type        : <0x9b2>
    <956>   DW_AT_data_member_location: 48
 <2><957>: Abbrev Number: 11 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x6899f): XferErrorCallback
    <95c>   DW_AT_decl_file   : 10
    <95d>   DW_AT_decl_line   : 128
    <95e>   DW_AT_decl_column : 28
    <95f>   DW_AT_type        : <0x9b2>
    <963>   DW_AT_data_member_location: 52
 <2><964>: Abbrev Number: 11 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x7d7cf): XferAbortCallback
    <969>   DW_AT_decl_file   : 10
    <96a>   DW_AT_decl_line   : 130
    <96b>   DW_AT_decl_column : 28
    <96c>   DW_AT_type        : <0x9b2>
    <970>   DW_AT_data_member_location: 56
 <2><971>: Abbrev Number: 11 (DW_TAG_member)
    <972>   DW_AT_name        : (indirect string, offset: 0x7012b): ErrorCode
    <976>   DW_AT_decl_file   : 10
    <977>   DW_AT_decl_line   : 132
    <978>   DW_AT_decl_column : 26
    <979>   DW_AT_type        : <0xd9>
    <97d>   DW_AT_data_member_location: 60
 <2><97e>: Abbrev Number: 11 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x36428): DmaBaseAddress
    <983>   DW_AT_decl_file   : 10
    <984>   DW_AT_decl_line   : 134
    <985>   DW_AT_decl_column : 27
    <986>   DW_AT_type        : <0x9b8>
    <98a>   DW_AT_data_member_location: 64
 <2><98b>: Abbrev Number: 11 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x7cd64): ChannelIndex
    <990>   DW_AT_decl_file   : 10
    <991>   DW_AT_decl_line   : 136
    <992>   DW_AT_decl_column : 26
    <993>   DW_AT_type        : <0xcd>
    <997>   DW_AT_data_member_location: 68
 <2><998>: Abbrev Number: 0
 <1><999>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <99a>   DW_AT_byte_size   : 4
    <99b>   DW_AT_type        : <0x131>
 <1><99f>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <9a0>   DW_AT_byte_size   : 4
 <1><9a1>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <9a2>   DW_AT_prototyped  : 1
    <9a2>   DW_AT_sibling     : <0x9ac>
 <2><9a6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <9a7>   DW_AT_type        : <0x9ac>
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9ad>   DW_AT_byte_size   : 4
    <9ae>   DW_AT_type        : <0x8ef>
 <1><9b2>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_type        : <0x9a1>
 <1><9b8>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9b9>   DW_AT_byte_size   : 4
    <9ba>   DW_AT_type        : <0x161>
 <1><9be>: Abbrev Number: 3 (DW_TAG_typedef)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x72a21): DMA_HandleTypeDef
    <9c3>   DW_AT_decl_file   : 10
    <9c4>   DW_AT_decl_line   : 138
    <9c5>   DW_AT_decl_column : 2
    <9c6>   DW_AT_type        : <0x8ef>
 <1><9ca>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_type        : <0x9f>
 <1><9d0>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <9d1>   DW_AT_byte_size   : 4
    <9d2>   DW_AT_type        : <0x9be>
 <1><9d6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9d7>   DW_AT_byte_size   : 20
    <9d8>   DW_AT_decl_file   : 11
    <9d9>   DW_AT_decl_line   : 46
    <9da>   DW_AT_decl_column : 9
    <9db>   DW_AT_sibling     : <0xa21>
 <2><9df>: Abbrev Number: 11 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x89a87): Prescaler
    <9e4>   DW_AT_decl_file   : 11
    <9e5>   DW_AT_decl_line   : 48
    <9e6>   DW_AT_decl_column : 12
    <9e7>   DW_AT_type        : <0xcd>
    <9eb>   DW_AT_data_member_location: 0
 <2><9ec>: Abbrev Number: 11 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x7a673): CounterMode
    <9f1>   DW_AT_decl_file   : 11
    <9f2>   DW_AT_decl_line   : 51
    <9f3>   DW_AT_decl_column : 12
    <9f4>   DW_AT_type        : <0xcd>
    <9f8>   DW_AT_data_member_location: 4
 <2><9f9>: Abbrev Number: 11 (DW_TAG_member)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x8fcee): Period
    <9fe>   DW_AT_decl_file   : 11
    <9ff>   DW_AT_decl_line   : 54
    <a00>   DW_AT_decl_column : 12
    <a01>   DW_AT_type        : <0xcd>
    <a05>   DW_AT_data_member_location: 8
 <2><a06>: Abbrev Number: 11 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0x366e8): ClockDivision
    <a0b>   DW_AT_decl_file   : 11
    <a0c>   DW_AT_decl_line   : 58
    <a0d>   DW_AT_decl_column : 12
    <a0e>   DW_AT_type        : <0xcd>
    <a12>   DW_AT_data_member_location: 12
 <2><a13>: Abbrev Number: 11 (DW_TAG_member)
    <a14>   DW_AT_name        : (indirect string, offset: 0xdbf9): AutoReloadPreload
    <a18>   DW_AT_decl_file   : 11
    <a19>   DW_AT_decl_line   : 61
    <a1a>   DW_AT_decl_column : 12
    <a1b>   DW_AT_type        : <0xcd>
    <a1f>   DW_AT_data_member_location: 16
 <2><a20>: Abbrev Number: 0
 <1><a21>: Abbrev Number: 3 (DW_TAG_typedef)
    <a22>   DW_AT_name        : (indirect string, offset: 0x2e84d): TIM_Base_InitTypeDef
    <a26>   DW_AT_decl_file   : 11
    <a27>   DW_AT_decl_line   : 63
    <a28>   DW_AT_decl_column : 3
    <a29>   DW_AT_type        : <0x9d6>
 <1><a2d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <a2e>   DW_AT_encoding    : 7	(unsigned)
    <a2f>   DW_AT_byte_size   : 1
    <a30>   DW_AT_type        : <0x3c>
    <a34>   DW_AT_decl_file   : 11
    <a35>   DW_AT_decl_line   : 230
    <a36>   DW_AT_decl_column : 1
    <a37>   DW_AT_sibling     : <0xa5a>
 <2><a3b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x43e4c): HAL_TIM_STATE_RESET
    <a40>   DW_AT_const_value : 0
 <2><a41>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0x4f71): HAL_TIM_STATE_READY
    <a46>   DW_AT_const_value : 1
 <2><a47>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0x22837): HAL_TIM_STATE_BUSY
    <a4c>   DW_AT_const_value : 2
 <2><a4d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0x70a3b): HAL_TIM_STATE_TIMEOUT
    <a52>   DW_AT_const_value : 3
 <2><a53>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0x1035e): HAL_TIM_STATE_ERROR
    <a58>   DW_AT_const_value : 4
 <2><a59>: Abbrev Number: 0
 <1><a5a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5b>   DW_AT_name        : (indirect string, offset: 0x6a70e): HAL_TIM_StateTypeDef
    <a5f>   DW_AT_decl_file   : 11
    <a60>   DW_AT_decl_line   : 236
    <a61>   DW_AT_decl_column : 3
    <a62>   DW_AT_type        : <0xa2d>
 <1><a66>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <a67>   DW_AT_type        : <0xa5a>
 <1><a6b>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <a6c>   DW_AT_encoding    : 7	(unsigned)
    <a6d>   DW_AT_byte_size   : 1
    <a6e>   DW_AT_type        : <0x3c>
    <a72>   DW_AT_decl_file   : 11
    <a73>   DW_AT_decl_line   : 242
    <a74>   DW_AT_decl_column : 1
    <a75>   DW_AT_sibling     : <0xa8c>
 <2><a79>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x5f635): HAL_TIM_CHANNEL_STATE_RESET
    <a7e>   DW_AT_const_value : 0
 <2><a7f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a80>   DW_AT_name        : (indirect string, offset: 0x4ef20): HAL_TIM_CHANNEL_STATE_READY
    <a84>   DW_AT_const_value : 1
 <2><a85>: Abbrev Number: 17 (DW_TAG_enumerator)
    <a86>   DW_AT_name        : (indirect string, offset: 0x40be4): HAL_TIM_CHANNEL_STATE_BUSY
    <a8a>   DW_AT_const_value : 2
 <2><a8b>: Abbrev Number: 0
 <1><a8c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x1ca8c): HAL_TIM_ChannelStateTypeDef
    <a91>   DW_AT_decl_file   : 11
    <a92>   DW_AT_decl_line   : 246
    <a93>   DW_AT_decl_column : 3
    <a94>   DW_AT_type        : <0xa6b>
 <1><a98>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <a99>   DW_AT_type        : <0xa8c>
 <1><a9d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <a9e>   DW_AT_encoding    : 7	(unsigned)
    <a9f>   DW_AT_byte_size   : 1
    <aa0>   DW_AT_type        : <0x3c>
    <aa4>   DW_AT_decl_file   : 11
    <aa5>   DW_AT_decl_line   : 252
    <aa6>   DW_AT_decl_column : 1
    <aa7>   DW_AT_sibling     : <0xabe>
 <2><aab>: Abbrev Number: 17 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x2e64): HAL_DMA_BURST_STATE_RESET
    <ab0>   DW_AT_const_value : 0
 <2><ab1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x4a38e): HAL_DMA_BURST_STATE_READY
    <ab6>   DW_AT_const_value : 1
 <2><ab7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x65302): HAL_DMA_BURST_STATE_BUSY
    <abc>   DW_AT_const_value : 2
 <2><abd>: Abbrev Number: 0
 <1><abe>: Abbrev Number: 15 (DW_TAG_typedef)
    <abf>   DW_AT_name        : (indirect string, offset: 0x12a24): HAL_TIM_DMABurstStateTypeDef
    <ac3>   DW_AT_decl_file   : 11
    <ac4>   DW_AT_decl_line   : 256
    <ac6>   DW_AT_decl_column : 3
    <ac7>   DW_AT_type        : <0xa9d>
 <1><acb>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <acc>   DW_AT_type        : <0xabe>
 <1><ad0>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <ad1>   DW_AT_encoding    : 7	(unsigned)
    <ad2>   DW_AT_byte_size   : 1
    <ad3>   DW_AT_type        : <0x3c>
    <ad7>   DW_AT_decl_file   : 11
    <ad8>   DW_AT_decl_line   : 262
    <ada>   DW_AT_decl_column : 1
    <adb>   DW_AT_sibling     : <0xafe>
 <2><adf>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x4b82d): HAL_TIM_ACTIVE_CHANNEL_1
    <ae4>   DW_AT_const_value : 1
 <2><ae5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x4b846): HAL_TIM_ACTIVE_CHANNEL_2
    <aea>   DW_AT_const_value : 2
 <2><aeb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <aec>   DW_AT_name        : (indirect string, offset: 0x4b85f): HAL_TIM_ACTIVE_CHANNEL_3
    <af0>   DW_AT_const_value : 4
 <2><af1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <af2>   DW_AT_name        : (indirect string, offset: 0x4b878): HAL_TIM_ACTIVE_CHANNEL_4
    <af6>   DW_AT_const_value : 8
 <2><af7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <af8>   DW_AT_name        : (indirect string, offset: 0x373b3): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <afc>   DW_AT_const_value : 0
 <2><afd>: Abbrev Number: 0
 <1><afe>: Abbrev Number: 15 (DW_TAG_typedef)
    <aff>   DW_AT_name        : (indirect string, offset: 0x46485): HAL_TIM_ActiveChannel
    <b03>   DW_AT_decl_file   : 11
    <b04>   DW_AT_decl_line   : 268
    <b06>   DW_AT_decl_column : 3
    <b07>   DW_AT_type        : <0xad0>
 <1><b0b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b0c>   DW_AT_byte_size   : 64
    <b0d>   DW_AT_decl_file   : 11
    <b0e>   DW_AT_decl_line   : 276
    <b10>   DW_AT_decl_column : 9
    <b11>   DW_AT_sibling     : <0xb86>
 <2><b15>: Abbrev Number: 13 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x340e8): Instance
    <b1a>   DW_AT_decl_file   : 11
    <b1b>   DW_AT_decl_line   : 279
    <b1d>   DW_AT_decl_column : 39
    <b1e>   DW_AT_type        : <0xb86>
    <b22>   DW_AT_data_member_location: 0
 <2><b23>: Abbrev Number: 13 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x89384): Init
    <b28>   DW_AT_decl_file   : 11
    <b29>   DW_AT_decl_line   : 280
    <b2b>   DW_AT_decl_column : 38
    <b2c>   DW_AT_type        : <0xa21>
    <b30>   DW_AT_data_member_location: 4
 <2><b31>: Abbrev Number: 13 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0x46493): Channel
    <b36>   DW_AT_decl_file   : 11
    <b37>   DW_AT_decl_line   : 281
    <b39>   DW_AT_decl_column : 38
    <b3a>   DW_AT_type        : <0xafe>
    <b3e>   DW_AT_data_member_location: 24
 <2><b3f>: Abbrev Number: 13 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0x50a1a): hdma
    <b44>   DW_AT_decl_file   : 11
    <b45>   DW_AT_decl_line   : 282
    <b47>   DW_AT_decl_column : 39
    <b48>   DW_AT_type        : <0xb8c>
    <b4c>   DW_AT_data_member_location: 28
 <2><b4d>: Abbrev Number: 13 (DW_TAG_member)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x6018e): Lock
    <b52>   DW_AT_decl_file   : 11
    <b53>   DW_AT_decl_line   : 284
    <b55>   DW_AT_decl_column : 38
    <b56>   DW_AT_type        : <0x5c4>
    <b5a>   DW_AT_data_member_location: 56
 <2><b5b>: Abbrev Number: 13 (DW_TAG_member)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x5fd38): State
    <b60>   DW_AT_decl_file   : 11
    <b61>   DW_AT_decl_line   : 285
    <b63>   DW_AT_decl_column : 38
    <b64>   DW_AT_type        : <0xa66>
    <b68>   DW_AT_data_member_location: 57
 <2><b69>: Abbrev Number: 13 (DW_TAG_member)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x8a614): ChannelState
    <b6e>   DW_AT_decl_file   : 11
    <b6f>   DW_AT_decl_line   : 286
    <b71>   DW_AT_decl_column : 38
    <b72>   DW_AT_type        : <0xbac>
    <b76>   DW_AT_data_member_location: 58
 <2><b77>: Abbrev Number: 13 (DW_TAG_member)
    <b78>   DW_AT_name        : (indirect string, offset: 0x89d31): DMABurstState
    <b7c>   DW_AT_decl_file   : 11
    <b7d>   DW_AT_decl_line   : 287
    <b7f>   DW_AT_decl_column : 38
    <b80>   DW_AT_type        : <0xacb>
    <b84>   DW_AT_data_member_location: 62
 <2><b85>: Abbrev Number: 0
 <1><b86>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <b87>   DW_AT_byte_size   : 4
    <b88>   DW_AT_type        : <0x4b0>
 <1><b8c>: Abbrev Number: 7 (DW_TAG_array_type)
    <b8d>   DW_AT_type        : <0x9d0>
    <b91>   DW_AT_sibling     : <0xb9c>
 <2><b95>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b96>   DW_AT_type        : <0x98>
    <b9a>   DW_AT_upper_bound : 6
 <2><b9b>: Abbrev Number: 0
 <1><b9c>: Abbrev Number: 7 (DW_TAG_array_type)
    <b9d>   DW_AT_type        : <0xa98>
    <ba1>   DW_AT_sibling     : <0xbac>
 <2><ba5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ba6>   DW_AT_type        : <0x98>
    <baa>   DW_AT_upper_bound : 3
 <2><bab>: Abbrev Number: 0
 <1><bac>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <bad>   DW_AT_type        : <0xb9c>
 <1><bb1>: Abbrev Number: 15 (DW_TAG_typedef)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xa88e): TIM_HandleTypeDef
    <bb6>   DW_AT_decl_file   : 11
    <bb7>   DW_AT_decl_line   : 313
    <bb9>   DW_AT_decl_column : 3
    <bba>   DW_AT_type        : <0xb0b>
 <1><bbe>: Abbrev Number: 9 (DW_TAG_structure_type)
    <bbf>   DW_AT_byte_size   : 32
    <bc0>   DW_AT_decl_file   : 12
    <bc1>   DW_AT_decl_line   : 46
    <bc2>   DW_AT_decl_column : 9
    <bc3>   DW_AT_sibling     : <0xc30>
 <2><bc7>: Abbrev Number: 11 (DW_TAG_member)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x7b411): BaudRate
    <bcc>   DW_AT_decl_file   : 12
    <bcd>   DW_AT_decl_line   : 48
    <bce>   DW_AT_decl_column : 12
    <bcf>   DW_AT_type        : <0xcd>
    <bd3>   DW_AT_data_member_location: 0
 <2><bd4>: Abbrev Number: 11 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x3eb3): WordLength
    <bd9>   DW_AT_decl_file   : 12
    <bda>   DW_AT_decl_line   : 66
    <bdb>   DW_AT_decl_column : 12
    <bdc>   DW_AT_type        : <0xcd>
    <be0>   DW_AT_data_member_location: 4
 <2><be1>: Abbrev Number: 11 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x7b61d): StopBits
    <be6>   DW_AT_decl_file   : 12
    <be7>   DW_AT_decl_line   : 69
    <be8>   DW_AT_decl_column : 12
    <be9>   DW_AT_type        : <0xcd>
    <bed>   DW_AT_data_member_location: 8
 <2><bee>: Abbrev Number: 11 (DW_TAG_member)
    <bef>   DW_AT_name        : (indirect string, offset: 0x3ab55): Parity
    <bf3>   DW_AT_decl_file   : 12
    <bf4>   DW_AT_decl_line   : 72
    <bf5>   DW_AT_decl_column : 12
    <bf6>   DW_AT_type        : <0xcd>
    <bfa>   DW_AT_data_member_location: 12
 <2><bfb>: Abbrev Number: 11 (DW_TAG_member)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x89baf): Mode
    <c00>   DW_AT_decl_file   : 12
    <c01>   DW_AT_decl_line   : 79
    <c02>   DW_AT_decl_column : 12
    <c03>   DW_AT_type        : <0xcd>
    <c07>   DW_AT_data_member_location: 16
 <2><c08>: Abbrev Number: 11 (DW_TAG_member)
    <c09>   DW_AT_name        : (indirect string, offset: 0x8c0b): HwFlowCtl
    <c0d>   DW_AT_decl_file   : 12
    <c0e>   DW_AT_decl_line   : 82
    <c0f>   DW_AT_decl_column : 12
    <c10>   DW_AT_type        : <0xcd>
    <c14>   DW_AT_data_member_location: 20
 <2><c15>: Abbrev Number: 11 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0x70f51): OverSampling
    <c1a>   DW_AT_decl_file   : 12
    <c1b>   DW_AT_decl_line   : 86
    <c1c>   DW_AT_decl_column : 12
    <c1d>   DW_AT_type        : <0xcd>
    <c21>   DW_AT_data_member_location: 24
 <2><c22>: Abbrev Number: 11 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x1bc7d): OneBitSampling
    <c27>   DW_AT_decl_file   : 12
    <c28>   DW_AT_decl_line   : 90
    <c29>   DW_AT_decl_column : 12
    <c2a>   DW_AT_type        : <0xcd>
    <c2e>   DW_AT_data_member_location: 28
 <2><c2f>: Abbrev Number: 0
 <1><c30>: Abbrev Number: 3 (DW_TAG_typedef)
    <c31>   DW_AT_name        : (indirect string, offset: 0x2633e): UART_InitTypeDef
    <c35>   DW_AT_decl_file   : 12
    <c36>   DW_AT_decl_line   : 95
    <c37>   DW_AT_decl_column : 3
    <c38>   DW_AT_type        : <0xbbe>
 <1><c3c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c3d>   DW_AT_byte_size   : 40
    <c3e>   DW_AT_decl_file   : 12
    <c3f>   DW_AT_decl_line   : 100
    <c40>   DW_AT_decl_column : 9
    <c41>   DW_AT_sibling     : <0xcc8>
 <2><c45>: Abbrev Number: 11 (DW_TAG_member)
    <c46>   DW_AT_name        : (indirect string, offset: 0x1af5e): AdvFeatureInit
    <c4a>   DW_AT_decl_file   : 12
    <c4b>   DW_AT_decl_line   : 102
    <c4c>   DW_AT_decl_column : 12
    <c4d>   DW_AT_type        : <0xcd>
    <c51>   DW_AT_data_member_location: 0
 <2><c52>: Abbrev Number: 11 (DW_TAG_member)
    <c53>   DW_AT_name        : (indirect string, offset: 0xc8a2): TxPinLevelInvert
    <c57>   DW_AT_decl_file   : 12
    <c58>   DW_AT_decl_line   : 107
    <c59>   DW_AT_decl_column : 12
    <c5a>   DW_AT_type        : <0xcd>
    <c5e>   DW_AT_data_member_location: 4
 <2><c5f>: Abbrev Number: 11 (DW_TAG_member)
    <c60>   DW_AT_name        : (indirect string, offset: 0x71234): RxPinLevelInvert
    <c64>   DW_AT_decl_file   : 12
    <c65>   DW_AT_decl_line   : 110
    <c66>   DW_AT_decl_column : 12
    <c67>   DW_AT_type        : <0xcd>
    <c6b>   DW_AT_data_member_location: 8
 <2><c6c>: Abbrev Number: 11 (DW_TAG_member)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x5afa9): DataInvert
    <c71>   DW_AT_decl_file   : 12
    <c72>   DW_AT_decl_line   : 113
    <c73>   DW_AT_decl_column : 12
    <c74>   DW_AT_type        : <0xcd>
    <c78>   DW_AT_data_member_location: 12
 <2><c79>: Abbrev Number: 11 (DW_TAG_member)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x2b18b): Swap
    <c7e>   DW_AT_decl_file   : 12
    <c7f>   DW_AT_decl_line   : 117
    <c80>   DW_AT_decl_column : 12
    <c81>   DW_AT_type        : <0xcd>
    <c85>   DW_AT_data_member_location: 16
 <2><c86>: Abbrev Number: 11 (DW_TAG_member)
    <c87>   DW_AT_name        : (indirect string, offset: 0x1b0c0): OverrunDisable
    <c8b>   DW_AT_decl_file   : 12
    <c8c>   DW_AT_decl_line   : 120
    <c8d>   DW_AT_decl_column : 12
    <c8e>   DW_AT_type        : <0xcd>
    <c92>   DW_AT_data_member_location: 20
 <2><c93>: Abbrev Number: 11 (DW_TAG_member)
    <c94>   DW_AT_name        : (indirect string, offset: 0x18e4d): DMADisableonRxError
    <c98>   DW_AT_decl_file   : 12
    <c99>   DW_AT_decl_line   : 123
    <c9a>   DW_AT_decl_column : 12
    <c9b>   DW_AT_type        : <0xcd>
    <c9f>   DW_AT_data_member_location: 24
 <2><ca0>: Abbrev Number: 11 (DW_TAG_member)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x8368e): AutoBaudRateEnable
    <ca5>   DW_AT_decl_file   : 12
    <ca6>   DW_AT_decl_line   : 126
    <ca7>   DW_AT_decl_column : 12
    <ca8>   DW_AT_type        : <0xcd>
    <cac>   DW_AT_data_member_location: 28
 <2><cad>: Abbrev Number: 11 (DW_TAG_member)
    <cae>   DW_AT_name        : (indirect string, offset: 0x726e1): AutoBaudRateMode
    <cb2>   DW_AT_decl_file   : 12
    <cb3>   DW_AT_decl_line   : 129
    <cb4>   DW_AT_decl_column : 12
    <cb5>   DW_AT_type        : <0xcd>
    <cb9>   DW_AT_data_member_location: 32
 <2><cba>: Abbrev Number: 11 (DW_TAG_member)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x3bac0): MSBFirst
    <cbf>   DW_AT_decl_file   : 12
    <cc0>   DW_AT_decl_line   : 133
    <cc1>   DW_AT_decl_column : 12
    <cc2>   DW_AT_type        : <0xcd>
    <cc6>   DW_AT_data_member_location: 36
 <2><cc7>: Abbrev Number: 0
 <1><cc8>: Abbrev Number: 3 (DW_TAG_typedef)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x64622): UART_AdvFeatureInitTypeDef
    <ccd>   DW_AT_decl_file   : 12
    <cce>   DW_AT_decl_line   : 135
    <ccf>   DW_AT_decl_column : 3
    <cd0>   DW_AT_type        : <0xc3c>
 <1><cd4>: Abbrev Number: 3 (DW_TAG_typedef)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x296d3): HAL_UART_StateTypeDef
    <cd9>   DW_AT_decl_file   : 12
    <cda>   DW_AT_decl_line   : 177
    <cdb>   DW_AT_decl_column : 18
    <cdc>   DW_AT_type        : <0xcd>
 <1><ce0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <ce1>   DW_AT_type        : <0xcd4>
 <1><ce5>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x71336): HAL_UART_RxTypeTypeDef
    <cea>   DW_AT_decl_file   : 12
    <ceb>   DW_AT_decl_line   : 201
    <cec>   DW_AT_decl_column : 18
    <ced>   DW_AT_type        : <0xcd>
 <1><cf1>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <cf2>   DW_AT_type        : <0xce5>
 <1><cf6>: Abbrev Number: 3 (DW_TAG_typedef)
    <cf7>   DW_AT_name        : (indirect string, offset: 0x11206): HAL_UART_RxEventTypeTypeDef
    <cfb>   DW_AT_decl_file   : 12
    <cfc>   DW_AT_decl_line   : 212
    <cfd>   DW_AT_decl_column : 18
    <cfe>   DW_AT_type        : <0xcd>
 <1><d02>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d03>   DW_AT_type        : <0xcf6>
 <1><d07>: Abbrev Number: 18 (DW_TAG_structure_type)
    <d08>   DW_AT_name        : (indirect string, offset: 0x4deb9): __UART_HandleTypeDef
    <d0c>   DW_AT_byte_size   : 136
    <d0d>   DW_AT_decl_file   : 12
    <d0e>   DW_AT_decl_line   : 217
    <d0f>   DW_AT_decl_column : 16
    <d10>   DW_AT_sibling     : <0xe1b>
 <2><d14>: Abbrev Number: 11 (DW_TAG_member)
    <d15>   DW_AT_name        : (indirect string, offset: 0x340e8): Instance
    <d19>   DW_AT_decl_file   : 12
    <d1a>   DW_AT_decl_line   : 219
    <d1b>   DW_AT_decl_column : 29
    <d1c>   DW_AT_type        : <0xe1b>
    <d20>   DW_AT_data_member_location: 0
 <2><d21>: Abbrev Number: 11 (DW_TAG_member)
    <d22>   DW_AT_name        : (indirect string, offset: 0x89384): Init
    <d26>   DW_AT_decl_file   : 12
    <d27>   DW_AT_decl_line   : 221
    <d28>   DW_AT_decl_column : 28
    <d29>   DW_AT_type        : <0xc30>
    <d2d>   DW_AT_data_member_location: 4
 <2><d2e>: Abbrev Number: 11 (DW_TAG_member)
    <d2f>   DW_AT_name        : (indirect string, offset: 0x694cc): AdvancedInit
    <d33>   DW_AT_decl_file   : 12
    <d34>   DW_AT_decl_line   : 223
    <d35>   DW_AT_decl_column : 30
    <d36>   DW_AT_type        : <0xcc8>
    <d3a>   DW_AT_data_member_location: 36
 <2><d3b>: Abbrev Number: 11 (DW_TAG_member)
    <d3c>   DW_AT_name        : (indirect string, offset: 0x404d8): pTxBuffPtr
    <d40>   DW_AT_decl_file   : 12
    <d41>   DW_AT_decl_line   : 225
    <d42>   DW_AT_decl_column : 29
    <d43>   DW_AT_type        : <0xe21>
    <d47>   DW_AT_data_member_location: 76
 <2><d48>: Abbrev Number: 11 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0x38b37): TxXferSize
    <d4d>   DW_AT_decl_file   : 12
    <d4e>   DW_AT_decl_line   : 227
    <d4f>   DW_AT_decl_column : 28
    <d50>   DW_AT_type        : <0xb0>
    <d54>   DW_AT_data_member_location: 80
 <2><d55>: Abbrev Number: 11 (DW_TAG_member)
    <d56>   DW_AT_name        : (indirect string, offset: 0x70f9c): TxXferCount
    <d5a>   DW_AT_decl_file   : 12
    <d5b>   DW_AT_decl_line   : 229
    <d5c>   DW_AT_decl_column : 28
    <d5d>   DW_AT_type        : <0xbc>
    <d61>   DW_AT_data_member_location: 82
 <2><d62>: Abbrev Number: 11 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0x7cfdb): pRxBuffPtr
    <d67>   DW_AT_decl_file   : 12
    <d68>   DW_AT_decl_line   : 231
    <d69>   DW_AT_decl_column : 29
    <d6a>   DW_AT_type        : <0x9ca>
    <d6e>   DW_AT_data_member_location: 84
 <2><d6f>: Abbrev Number: 11 (DW_TAG_member)
    <d70>   DW_AT_name        : (indirect string, offset: 0x42ebe): RxXferSize
    <d74>   DW_AT_decl_file   : 12
    <d75>   DW_AT_decl_line   : 233
    <d76>   DW_AT_decl_column : 28
    <d77>   DW_AT_type        : <0xb0>
    <d7b>   DW_AT_data_member_location: 88
 <2><d7c>: Abbrev Number: 11 (DW_TAG_member)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x50be0): RxXferCount
    <d81>   DW_AT_decl_file   : 12
    <d82>   DW_AT_decl_line   : 235
    <d83>   DW_AT_decl_column : 28
    <d84>   DW_AT_type        : <0xbc>
    <d88>   DW_AT_data_member_location: 90
 <2><d89>: Abbrev Number: 11 (DW_TAG_member)
    <d8a>   DW_AT_name        : (indirect string, offset: 0x8a8a0): Mask
    <d8e>   DW_AT_decl_file   : 12
    <d8f>   DW_AT_decl_line   : 237
    <d90>   DW_AT_decl_column : 28
    <d91>   DW_AT_type        : <0xb0>
    <d95>   DW_AT_data_member_location: 92
 <2><d96>: Abbrev Number: 11 (DW_TAG_member)
    <d97>   DW_AT_name        : (indirect string, offset: 0x70801): ReceptionType
    <d9b>   DW_AT_decl_file   : 12
    <d9c>   DW_AT_decl_line   : 239
    <d9d>   DW_AT_decl_column : 31
    <d9e>   DW_AT_type        : <0xcf1>
    <da2>   DW_AT_data_member_location: 96
 <2><da3>: Abbrev Number: 11 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0x8b17a): RxEventType
    <da8>   DW_AT_decl_file   : 12
    <da9>   DW_AT_decl_line   : 241
    <daa>   DW_AT_decl_column : 36
    <dab>   DW_AT_type        : <0xd02>
    <daf>   DW_AT_data_member_location: 100
 <2><db0>: Abbrev Number: 11 (DW_TAG_member)
    <db1>   DW_AT_name        : (indirect string, offset: 0x73f6a): RxISR
    <db5>   DW_AT_decl_file   : 12
    <db6>   DW_AT_decl_line   : 243
    <db7>   DW_AT_decl_column : 10
    <db8>   DW_AT_type        : <0xe38>
    <dbc>   DW_AT_data_member_location: 104
 <2><dbd>: Abbrev Number: 11 (DW_TAG_member)
    <dbe>   DW_AT_name        : (indirect string, offset: 0x4357d): TxISR
    <dc2>   DW_AT_decl_file   : 12
    <dc3>   DW_AT_decl_line   : 245
    <dc4>   DW_AT_decl_column : 10
    <dc5>   DW_AT_type        : <0xe38>
    <dc9>   DW_AT_data_member_location: 108
 <2><dca>: Abbrev Number: 11 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x6e76d): hdmatx
    <dcf>   DW_AT_decl_file   : 12
    <dd0>   DW_AT_decl_line   : 247
    <dd1>   DW_AT_decl_column : 29
    <dd2>   DW_AT_type        : <0x9d0>
    <dd6>   DW_AT_data_member_location: 112
 <2><dd7>: Abbrev Number: 11 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x827a0): hdmarx
    <ddc>   DW_AT_decl_file   : 12
    <ddd>   DW_AT_decl_line   : 249
    <dde>   DW_AT_decl_column : 29
    <ddf>   DW_AT_type        : <0x9d0>
    <de3>   DW_AT_data_member_location: 116
 <2><de4>: Abbrev Number: 11 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x6018e): Lock
    <de9>   DW_AT_decl_file   : 12
    <dea>   DW_AT_decl_line   : 251
    <deb>   DW_AT_decl_column : 29
    <dec>   DW_AT_type        : <0x5c4>
    <df0>   DW_AT_data_member_location: 120
 <2><df1>: Abbrev Number: 11 (DW_TAG_member)
    <df2>   DW_AT_name        : (indirect string, offset: 0x36609): gState
    <df6>   DW_AT_decl_file   : 12
    <df7>   DW_AT_decl_line   : 253
    <df8>   DW_AT_decl_column : 33
    <df9>   DW_AT_type        : <0xce0>
    <dfd>   DW_AT_data_member_location: 124
 <2><dfe>: Abbrev Number: 13 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0x7976f): RxState
    <e03>   DW_AT_decl_file   : 12
    <e04>   DW_AT_decl_line   : 257
    <e06>   DW_AT_decl_column : 33
    <e07>   DW_AT_type        : <0xce0>
    <e0b>   DW_AT_data_member_location: 128
 <2><e0c>: Abbrev Number: 13 (DW_TAG_member)
    <e0d>   DW_AT_name        : (indirect string, offset: 0x7012b): ErrorCode
    <e11>   DW_AT_decl_file   : 12
    <e12>   DW_AT_decl_line   : 260
    <e14>   DW_AT_decl_column : 33
    <e15>   DW_AT_type        : <0xd9>
    <e19>   DW_AT_data_member_location: 132
 <2><e1a>: Abbrev Number: 0
 <1><e1b>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e1c>   DW_AT_byte_size   : 4
    <e1d>   DW_AT_type        : <0x562>
 <1><e21>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e22>   DW_AT_byte_size   : 4
    <e23>   DW_AT_type        : <0xab>
 <1><e27>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <e28>   DW_AT_prototyped  : 1
    <e28>   DW_AT_sibling     : <0xe32>
 <2><e2c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e2d>   DW_AT_type        : <0xe32>
 <2><e31>: Abbrev Number: 0
 <1><e32>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e33>   DW_AT_byte_size   : 4
    <e34>   DW_AT_type        : <0xd07>
 <1><e38>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e39>   DW_AT_byte_size   : 4
    <e3a>   DW_AT_type        : <0xe27>
 <1><e3e>: Abbrev Number: 15 (DW_TAG_typedef)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x4debb): UART_HandleTypeDef
    <e43>   DW_AT_decl_file   : 12
    <e44>   DW_AT_decl_line   : 278
    <e46>   DW_AT_decl_column : 3
    <e47>   DW_AT_type        : <0xd07>
 <1><e4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <e4c>   DW_AT_byte_size   : 1
    <e4d>   DW_AT_encoding    : 8	(unsigned char)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x2baf3): char
 <1><e52>: Abbrev Number: 5 (DW_TAG_const_type)
    <e53>   DW_AT_type        : <0xe4b>
 <1><e57>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e58>   DW_AT_byte_size   : 4
    <e59>   DW_AT_type        : <0xe52>
 <1><e5d>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <e5e>   DW_AT_byte_size   : 4
    <e5f>   DW_AT_type        : <0xe63>
 <1><e63>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <e64>   DW_AT_prototyped  : 1
    <e64>   DW_AT_sibling     : <0xe6e>
 <2><e68>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e69>   DW_AT_type        : <0x99f>
 <2><e6d>: Abbrev Number: 0
 <1><e6e>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e6f>   DW_AT_encoding    : 5	(signed)
    <e70>   DW_AT_byte_size   : 4
    <e71>   DW_AT_type        : <0x91>
    <e75>   DW_AT_decl_file   : 13
    <e76>   DW_AT_decl_line   : 82
    <e77>   DW_AT_decl_column : 14
    <e78>   DW_AT_sibling     : <0xfbe>
 <2><e7c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x284ef): osPriorityNone
    <e81>   DW_AT_const_value : 0
 <2><e82>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e83>   DW_AT_name        : (indirect string, offset: 0x74c7c): osPriorityIdle
    <e87>   DW_AT_const_value : 1
 <2><e88>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e89>   DW_AT_name        : (indirect string, offset: 0x7c104): osPriorityLow
    <e8d>   DW_AT_const_value : 8
 <2><e8e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x7f77d): osPriorityLow1
    <e93>   DW_AT_const_value : 9
 <2><e94>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e95>   DW_AT_name        : (indirect string, offset: 0x7f78c): osPriorityLow2
    <e99>   DW_AT_const_value : 10
 <2><e9a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x31ec2): osPriorityLow3
    <e9f>   DW_AT_const_value : 11
 <2><ea0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x7f7c1): osPriorityLow4
    <ea5>   DW_AT_const_value : 12
 <2><ea6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x31f0f): osPriorityLow5
    <eab>   DW_AT_const_value : 13
 <2><eac>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ead>   DW_AT_name        : (indirect string, offset: 0x7f7fc): osPriorityLow6
    <eb1>   DW_AT_const_value : 14
 <2><eb2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eb3>   DW_AT_name        : (indirect string, offset: 0x7f80b): osPriorityLow7
    <eb7>   DW_AT_const_value : 15
 <2><eb8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x8149c): osPriorityBelowNormal
    <ebd>   DW_AT_const_value : 16
 <2><ebe>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x67291): osPriorityBelowNormal1
    <ec3>   DW_AT_const_value : 17
 <2><ec4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x721da): osPriorityBelowNormal2
    <ec9>   DW_AT_const_value : 18
 <2><eca>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x721f1): osPriorityBelowNormal3
    <ecf>   DW_AT_const_value : 19
 <2><ed0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x72208): osPriorityBelowNormal4
    <ed5>   DW_AT_const_value : 20
 <2><ed6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x7221f): osPriorityBelowNormal5
    <edb>   DW_AT_const_value : 21
 <2><edc>: Abbrev Number: 17 (DW_TAG_enumerator)
    <edd>   DW_AT_name        : (indirect string, offset: 0x72236): osPriorityBelowNormal6
    <ee1>   DW_AT_const_value : 22
 <2><ee2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x7224d): osPriorityBelowNormal7
    <ee7>   DW_AT_const_value : 23
 <2><ee8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x6da78): osPriorityNormal
    <eed>   DW_AT_const_value : 24
 <2><eee>: Abbrev Number: 17 (DW_TAG_enumerator)
    <eef>   DW_AT_name        : (indirect string, offset: 0x15f66): osPriorityNormal1
    <ef3>   DW_AT_const_value : 25
 <2><ef4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x15f78): osPriorityNormal2
    <ef9>   DW_AT_const_value : 26
 <2><efa>: Abbrev Number: 17 (DW_TAG_enumerator)
    <efb>   DW_AT_name        : (indirect string, offset: 0x15f8a): osPriorityNormal3
    <eff>   DW_AT_const_value : 27
 <2><f00>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f01>   DW_AT_name        : (indirect string, offset: 0x15f9c): osPriorityNormal4
    <f05>   DW_AT_const_value : 28
 <2><f06>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f07>   DW_AT_name        : (indirect string, offset: 0x15fae): osPriorityNormal5
    <f0b>   DW_AT_const_value : 29
 <2><f0c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x15fc0): osPriorityNormal6
    <f11>   DW_AT_const_value : 30
 <2><f12>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f13>   DW_AT_name        : (indirect string, offset: 0x15fd2): osPriorityNormal7
    <f17>   DW_AT_const_value : 31
 <2><f18>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f19>   DW_AT_name        : (indirect string, offset: 0x568bc): osPriorityAboveNormal
    <f1d>   DW_AT_const_value : 32
 <2><f1e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x8622f): osPriorityAboveNormal1
    <f23>   DW_AT_const_value : 33
 <2><f24>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x86246): osPriorityAboveNormal2
    <f29>   DW_AT_const_value : 34
 <2><f2a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x8625d): osPriorityAboveNormal3
    <f2f>   DW_AT_const_value : 35
 <2><f30>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x86274): osPriorityAboveNormal4
    <f35>   DW_AT_const_value : 36
 <2><f36>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x8628b): osPriorityAboveNormal5
    <f3b>   DW_AT_const_value : 37
 <2><f3c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x862a2): osPriorityAboveNormal6
    <f41>   DW_AT_const_value : 38
 <2><f42>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x862b9): osPriorityAboveNormal7
    <f47>   DW_AT_const_value : 39
 <2><f48>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x2ffbd): osPriorityHigh
    <f4d>   DW_AT_const_value : 40
 <2><f4e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x59614): osPriorityHigh1
    <f53>   DW_AT_const_value : 41
 <2><f54>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f55>   DW_AT_name        : (indirect string, offset: 0x59624): osPriorityHigh2
    <f59>   DW_AT_const_value : 42
 <2><f5a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x59634): osPriorityHigh3
    <f5f>   DW_AT_const_value : 43
 <2><f60>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f61>   DW_AT_name        : (indirect string, offset: 0x59644): osPriorityHigh4
    <f65>   DW_AT_const_value : 44
 <2><f66>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f67>   DW_AT_name        : (indirect string, offset: 0x59654): osPriorityHigh5
    <f6b>   DW_AT_const_value : 45
 <2><f6c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x59664): osPriorityHigh6
    <f71>   DW_AT_const_value : 46
 <2><f72>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f73>   DW_AT_name        : (indirect string, offset: 0x59674): osPriorityHigh7
    <f77>   DW_AT_const_value : 47
 <2><f78>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f79>   DW_AT_name        : (indirect string, offset: 0x7a278): osPriorityRealtime
    <f7d>   DW_AT_const_value : 48
 <2><f7e>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x54aaa): osPriorityRealtime1
    <f83>   DW_AT_const_value : 49
 <2><f84>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f85>   DW_AT_name        : (indirect string, offset: 0x54abe): osPriorityRealtime2
    <f89>   DW_AT_const_value : 50
 <2><f8a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x54ad2): osPriorityRealtime3
    <f8f>   DW_AT_const_value : 51
 <2><f90>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f91>   DW_AT_name        : (indirect string, offset: 0x54ae6): osPriorityRealtime4
    <f95>   DW_AT_const_value : 52
 <2><f96>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f97>   DW_AT_name        : (indirect string, offset: 0x54afa): osPriorityRealtime5
    <f9b>   DW_AT_const_value : 53
 <2><f9c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <f9d>   DW_AT_name        : (indirect string, offset: 0x54b0e): osPriorityRealtime6
    <fa1>   DW_AT_const_value : 54
 <2><fa2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x54b22): osPriorityRealtime7
    <fa7>   DW_AT_const_value : 55
 <2><fa8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x3c985): osPriorityISR
    <fad>   DW_AT_const_value : 56
 <2><fae>: Abbrev Number: 24 (DW_TAG_enumerator)
    <faf>   DW_AT_name        : (indirect string, offset: 0x77437): osPriorityError
    <fb3>   DW_AT_const_value : -1
 <2><fb4>: Abbrev Number: 25 (DW_TAG_enumerator)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x7fb47): osPriorityReserved
    <fb9>   DW_AT_const_value : 0x7fffffff
 <2><fbd>: Abbrev Number: 0
 <1><fbe>: Abbrev Number: 3 (DW_TAG_typedef)
    <fbf>   DW_AT_name        : (indirect string, offset: 0x55949): osPriority_t
    <fc3>   DW_AT_decl_file   : 13
    <fc4>   DW_AT_decl_line   : 136
    <fc5>   DW_AT_decl_column : 3
    <fc6>   DW_AT_type        : <0xe6e>
 <1><fca>: Abbrev Number: 3 (DW_TAG_typedef)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x72ee5): osThreadFunc_t
    <fcf>   DW_AT_decl_file   : 13
    <fd0>   DW_AT_decl_line   : 139
    <fd1>   DW_AT_decl_column : 16
    <fd2>   DW_AT_type        : <0xe5d>
 <1><fd6>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <fd7>   DW_AT_encoding    : 5	(signed)
    <fd8>   DW_AT_byte_size   : 4
    <fd9>   DW_AT_type        : <0x91>
    <fdd>   DW_AT_decl_file   : 13
    <fde>   DW_AT_decl_line   : 176
    <fdf>   DW_AT_decl_column : 14
    <fe0>   DW_AT_sibling     : <0x1018>
 <2><fe4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x772d0): osOK
    <fe9>   DW_AT_const_value : 0
 <2><fea>: Abbrev Number: 24 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0x3f50b): osError
    <fef>   DW_AT_const_value : -1
 <2><ff0>: Abbrev Number: 24 (DW_TAG_enumerator)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x79a65): osErrorTimeout
    <ff5>   DW_AT_const_value : -2
 <2><ff6>: Abbrev Number: 24 (DW_TAG_enumerator)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x12697): osErrorResource
    <ffb>   DW_AT_const_value : -3
 <2><ffc>: Abbrev Number: 24 (DW_TAG_enumerator)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x236a2): osErrorParameter
    <1001>   DW_AT_const_value : -4
 <2><1002>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1003>   DW_AT_name        : (indirect string, offset: 0x18201): osErrorNoMemory
    <1007>   DW_AT_const_value : -5
 <2><1008>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1009>   DW_AT_name        : (indirect string, offset: 0x24947): osErrorISR
    <100d>   DW_AT_const_value : -6
 <2><100e>: Abbrev Number: 25 (DW_TAG_enumerator)
    <100f>   DW_AT_name        : (indirect string, offset: 0x43da8): osStatusReserved
    <1013>   DW_AT_const_value : 0x7fffffff
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 3 (DW_TAG_typedef)
    <1019>   DW_AT_name        : (indirect string, offset: 0x2de34): osStatus_t
    <101d>   DW_AT_decl_file   : 13
    <101e>   DW_AT_decl_line   : 185
    <101f>   DW_AT_decl_column : 3
    <1020>   DW_AT_type        : <0xfd6>
 <1><1024>: Abbrev Number: 3 (DW_TAG_typedef)
    <1025>   DW_AT_name        : (indirect string, offset: 0x2ff86): osThreadId_t
    <1029>   DW_AT_decl_file   : 13
    <102a>   DW_AT_decl_line   : 189
    <102b>   DW_AT_decl_column : 15
    <102c>   DW_AT_type        : <0x99f>
 <1><1030>: Abbrev Number: 3 (DW_TAG_typedef)
    <1031>   DW_AT_name        : (indirect string, offset: 0x6766d): osSemaphoreId_t
    <1035>   DW_AT_decl_file   : 13
    <1036>   DW_AT_decl_line   : 201
    <1037>   DW_AT_decl_column : 15
    <1038>   DW_AT_type        : <0x99f>
 <1><103c>: Abbrev Number: 3 (DW_TAG_typedef)
    <103d>   DW_AT_name        : (indirect string, offset: 0x3ccd2): osMessageQueueId_t
    <1041>   DW_AT_decl_file   : 13
    <1042>   DW_AT_decl_line   : 207
    <1043>   DW_AT_decl_column : 15
    <1044>   DW_AT_type        : <0x99f>
 <1><1048>: Abbrev Number: 3 (DW_TAG_typedef)
    <1049>   DW_AT_name        : (indirect string, offset: 0x5ab8f): TZ_ModuleId_t
    <104d>   DW_AT_decl_file   : 13
    <104e>   DW_AT_decl_line   : 213
    <104f>   DW_AT_decl_column : 18
    <1050>   DW_AT_type        : <0xcd>
 <1><1054>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1055>   DW_AT_byte_size   : 36
    <1056>   DW_AT_decl_file   : 13
    <1057>   DW_AT_decl_line   : 218
    <1058>   DW_AT_decl_column : 9
    <1059>   DW_AT_sibling     : <0x10d3>
 <2><105d>: Abbrev Number: 11 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0x59e6e): name
    <1062>   DW_AT_decl_file   : 13
    <1063>   DW_AT_decl_line   : 219
    <1064>   DW_AT_decl_column : 33
    <1065>   DW_AT_type        : <0xe57>
    <1069>   DW_AT_data_member_location: 0
 <2><106a>: Abbrev Number: 11 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x57fb3): attr_bits
    <106f>   DW_AT_decl_file   : 13
    <1070>   DW_AT_decl_line   : 220
    <1071>   DW_AT_decl_column : 28
    <1072>   DW_AT_type        : <0xcd>
    <1076>   DW_AT_data_member_location: 4
 <2><1077>: Abbrev Number: 11 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0x1ae54): cb_mem
    <107c>   DW_AT_decl_file   : 13
    <107d>   DW_AT_decl_line   : 221
    <107e>   DW_AT_decl_column : 30
    <107f>   DW_AT_type        : <0x99f>
    <1083>   DW_AT_data_member_location: 8
 <2><1084>: Abbrev Number: 11 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x7f2bc): cb_size
    <1089>   DW_AT_decl_file   : 13
    <108a>   DW_AT_decl_line   : 222
    <108b>   DW_AT_decl_column : 30
    <108c>   DW_AT_type        : <0xcd>
    <1090>   DW_AT_data_member_location: 12
 <2><1091>: Abbrev Number: 11 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0x7a83b): stack_mem
    <1096>   DW_AT_decl_file   : 13
    <1097>   DW_AT_decl_line   : 223
    <1098>   DW_AT_decl_column : 27
    <1099>   DW_AT_type        : <0x99f>
    <109d>   DW_AT_data_member_location: 16
 <2><109e>: Abbrev Number: 11 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0x54b36): stack_size
    <10a3>   DW_AT_decl_file   : 13
    <10a4>   DW_AT_decl_line   : 224
    <10a5>   DW_AT_decl_column : 27
    <10a6>   DW_AT_type        : <0xcd>
    <10aa>   DW_AT_data_member_location: 20
 <2><10ab>: Abbrev Number: 11 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x34cdd): priority
    <10b0>   DW_AT_decl_file   : 13
    <10b1>   DW_AT_decl_line   : 225
    <10b2>   DW_AT_decl_column : 29
    <10b3>   DW_AT_type        : <0xfbe>
    <10b7>   DW_AT_data_member_location: 24
 <2><10b8>: Abbrev Number: 11 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x3a244): tz_module
